{
  "current": [
    {
      "title": "Lords of Uncreation",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL28803446W",
      "date_read": "2025-08-19",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Eyes of the Void",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL26518910W",
      "date_read": "2025-08-13",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Sequel to Shards of Earth.\r\nAn Architect almost destroyed humanity's foremost colony, until Idris Telemmier turned it aside. But that was just the start of the war - and now no planet is safe. Ancient artefacts once repelled these vast aliens, but they are now terrifyingly ineffective. However, the ruins of a lost civilization offer hope."
    },
    {
      "title": "Shards of Earth",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL24481122W",
      "date_read": "2025-07-27",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Eighty years ago, Earth was destroyed by an alien 'Architect'. Some escaped, but millions more died. So to protect its colonies, humanity shaped the minds of Idris and others into weapons and sent them into battle. But the Architects disappeared, and heroes like Idris were forgotten. However, he's glad of it. This particular living weapon would rather retire to a shabby salvage vessel then be anyone's ammunition. Then this small ship makes a huge discovery."
    },
    {
      "title": "Project Hail Mary",
      "author": "Andy Weir",
      "openlibrary_key": "OL21745884W",
      "date_read": "2025-07-14",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission–and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company.\r\n\r\nHis crewmates dead, his memories fuzzily returning, he realizes that an impossible task now confronts him. Alone on this tiny ship that’s been cobbled together by every government and space agency on the planet and hurled into the depths of space, it’s up to him to conquer an extinction-level threat to our species.\r\n\r\nAnd thanks to an unexpected ally, he just might have a chance.\r\n\r\nPart scientific mystery, part dazzling interstellar journey, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian–while taking us to places it never dreamed of going."
    },
    {
      "title": "The State Of The Art",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL8368448W",
      "date_read": "2025-07-02",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "The first ever collection of Iain Banks’s short fiction, this volume includes the acclaimed novella, The State of the Art. This is a striking addition to the growing body of Culture lore, and adds definition and scale to the previous works by using the Earth of 1977 as contrast. The other stories in the collection range from science fiction to horror, dark-coated fantasy to morality tale."
    },
    {
      "title": "The Hydrogen Sonata",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL17346835W",
      "date_read": "2025-06-24",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Suspected of involvement after the Regimental High Command is destroyed as they prepared to go to a new level of existence called Sublime, Lieutenant Commander Vyr Cossont must find a nine-thousand-year-old man to clear her name."
    },
    {
      "title": "Surface Detail",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL15544038W",
      "date_read": "2025-06-17",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "It begins in the realm of the Real, where matter still matters.\r\n\r\nIt begins with a murder.\r\n\r\nAnd it will not end until the Culture has gone to war with death itself.\r\n\r\nLededje Y'breq is one of the Intagliated, her marked body bearing witness to a family shame, her life belonging to a man whose lust for power is without limit. Prepared to risk everything for her freedom, her release, when it comes, is at a price, and to put things right she will need the help of the Culture.\r\n\r\nBenevolent, enlightened and almost infinitely resourceful though it may be, the Culture can only do so much for any individual. With the assistance of one of its most powerful - and arguably deranged - warships, Lededje finds herself heading into a combat zone not even sure which side the Culture is really on. A war - brutal, far-reaching - is already raging within the digital realms that store the souls of the dead, and it's about to erupt into reality.\r\n\r\nIt started in the realm of the Real and that is where it will end. It will touch countless lives and affect entire civilizations, but at the center of it all is a young woman whose need for revenge masks another motive altogether.\r\n\r\nSURFACE DETAIL is Iain M. Banks' new Culture novel, a breathtaking achievement from a writer whose body of work is without parallel in the modern history of science fiction."
    },
    {
      "title": "Matter",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL100768W",
      "date_read": "2025-06-08",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "In a world renowned even within a galaxy full of wonders, a crime within a war. For one brother it means a desperate flight, and a search for the one - maybe two - people who could clear his name.  For his brother it means a life lived under constant threat of treachery and murder.  And for their sister, even without knowing the full truth, it means returning to a place she'd thought abandoned forever.Only the sister is not what she once was; Djan Seriy Anaplian has changed almost beyond recognition to become an agent of the Culture's Special Circumstances section, charged with high-level interference in civilisations throughout the greater galaxy.Concealing her new identity - and her particular set of abilities - might be a dangerous strategy, however. In the world to which Anaplian returns, nothing is quite as it seems; and determining the appropriate level of interference in someone else's war is never a simple matter.MATTER is a novel of dazzling wit and serious purpose. An extraordinary feat of storytelling and breathtaking invention on a grand scale, it is a tour de force from a writer who has turned science fiction on its head."
    },
    {
      "title": "Look To Windward",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL100773W",
      "date_read": "2025-05-21",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "It was one of the less glorious incidents of a long-ago war.\r\n\r\nIt led to the destruction of two suns and the billions of lives they supported.\r\n\r\nNow, eight hundred years later, the light from the first of those ancient mistakes has reached the Culture Orbital, Masaq.\r\n\r\nThe light from the second may not."
    },
    {
      "title": "Inversions",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL100772W",
      "date_read": "2025-05-12",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "In the winter palace, the King’s new physician has more enemies than she at first realises. But then she also has more remedies to hand than those who wish her ill can know about.\r\n\r\nIn another palace across the mountains, in the service of the regicidal Protector General, the chief bodyguard, too, has his enemies. But his enemies strike more swiftly, and his means of combating them are more traditional."
    },
    {
      "title": "Use of Weapons",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL8339333W",
      "date_read": "2025-03-06",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Brain of the Firm",
      "author": "Stafford Beer",
      "openlibrary_key": "OL3054939W",
      "date_read": "2025-02-19",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Science"
      ],
      "first_publish_date": "1972",
      "description": ""
    },
    {
      "title": "The Player Of Games",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL100779W",
      "date_read": "2025-02-09",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "The Culture - a human/machine symbiotic society - has thrown up many great Game Players, and one of the greatest is Gurgeh. Jernau Morat Gurgeh. The Player of Games. Master of every board, computer, and strategy.\r\nBored with success, Gurgeh travels to the Empire of Azad, cruel and incredibly wealthy, to try their fabulous game ... a game so complex, so like life itself, that the winner becomes emperor. Mocked, blackmailed, almost murdered, Gurgeh accepts the game, and with it the challenge of his life - a very possibly his death."
    },
    {
      "title": "Consider Phlebas",
      "author": "Iain M. Banks",
      "openlibrary_key": "OL8368432W",
      "date_read": "2025-01-29",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Consider Phlebas is perhaps one of the lesser-known, but nevertheless the first, of the revelationary late Iain M. Banks' science fiction books. Consider Phlebas introduces us to the complex world of the mind-controlling, ubiquitous utopia of the Culture, which contrasts to their mortal sentient enemies. Iain Banks creates an imaginative and encapsulating premise to keep the reader hooked for more, with hints of science fiction and alien humour to liven a deadly race against an omnipotent foe."
    },
    {
      "title": "The Housekeeper and the Professor",
      "author": "Yoko Ogawa",
      "openlibrary_key": "OL8397574W",
      "date_read": "2025-01-26",
      "favourite": false,
      "genres": [
        "Fiction",
        "Japan"
      ],
      "description": "He is a brilliant maths professor with a peculiar problem - ever since a traumatic head injury some seventeen years ago, he has lived with only eighty minutes of short-term memory. She is a sensitive but astute young housekeeper with a ten-year-old son, who is entrusted to take care of him. Each morning, as the Professor and the Housekeeper are reintroduced to one another, a strange, beautiful relationship blossoms between them. The Professor may not remember what he had for breakfast, but his mind is still alive with elegant equations from the past. He devises clever maths riddles - based on her shoe size or her birthday - and the numbers, in all of their articulate order, reveal a sheltering and poetic world to both the Housekeeper and her little boy. With each new equation, the three lost souls forge an affection more mysterious than imaginary numbers, and a bond that runs deeper than memory. The Housekeeper and the Professor is an enchanting story about what it means to live in the present, and about the curious equations that can create a family where one before did not exist."
    },
    {
      "title": "Lost Japan: Last Glimpse of Beautiful Japan",
      "author": "Alex Kerr",
      "openlibrary_key": "OL21102233W",
      "date_read": "2025-01-20",
      "favourite": false,
      "genres": [
        "History",
        "Japan",
        "Memoir",
        "Non-Fiction",
        "Travel"
      ],
      "description": ""
    },
    {
      "title": "A Year with Swollen Appendices",
      "author": "Brian Eno",
      "openlibrary_key": "OL21003115W",
      "date_read": "2025-01-15",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Children of Memory",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL28018696W",
      "date_read": "2025-01-12",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Children of Ruin",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL20079532W",
      "date_read": "2025-01-09",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Sequel to Children of Time."
    },
    {
      "title": "The Roads to Sata",
      "author": "Alan Booth",
      "openlibrary_key": "OL3746489W",
      "date_read": "2024-12-25",
      "favourite": false,
      "genres": [
        "History",
        "Japan",
        "Memoir",
        "Non-Fiction",
        "Travel"
      ],
      "description": "raveling only along small back roads, Alan Booth traversed Japan's entire length on foot, from Soya at the country's northernmost tip, to Cape Sata in the extreme south, across three islands and some 2,000 miles of rural Japan. The Roads to Sata is his wry, witty, inimitable account of that prodigious trek. \r\n\r\nAlthough he was a city person-he was brought up in London and spent most of his adult life in Tokyo - Booth had an extraordinary ability to capture the feel of rural Japan in his writing. Throughout his long and arduous trek, he encountered a variety of people who inhabit the Japanese countryside-from fishermen and soldiers, to bar hostesses and school teachers, to hermits, drunks, and tramps. His wonderful and often hilarious descriptions of these encounters are the highlights of these pages, painting a multifaceted picture of Japan from the perspective of an outsider, but with the knowledge of an insider. \r\n\r\nThe Roads to Sata is travel writing at its best, illuminating and disarming, poignant yet hilarious, critical but respectful. Traveling across Japan with Alan Booth, readers will enjoy the wit and insight of a uniquely perceptive guide, and more importantly, they will discover a new face of an often misunderstood nation."
    },
    {
      "title": "The Dice Man",
      "author": "Luke Rhinehart",
      "openlibrary_key": "OL1842342W",
      "date_read": "2024-12-23",
      "favourite": false,
      "genres": [
        "Fiction",
        "Philosophy",
        "Psychology"
      ],
      "first_publish_date": "April 7, 2003",
      "description": "The cult classic that can still change your life...Let the dice decide! This is the philosophy that changes the life of bored psychiatrist Luke Rhinehart - and in some ways changes the world as well. Because once you hand over your life to the dice, anything can happen. Entertaining, humorous, scary, shocking, subversive, The Dice Man is one of the cult bestsellers of our time."
    },
    {
      "title": "On Some Faraway Beach: The Life and Times of Brian Eno",
      "author": "David Sheppard",
      "openlibrary_key": "OL19930258W",
      "date_read": "2024-12-18",
      "favourite": false,
      "genres": [
        "Biography",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Children of Time",
      "author": "Adrian Tchaikovsky",
      "openlibrary_key": "OL17373843W",
      "date_read": "2024-12-14",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "The last remnants of the human race left a dying Earth, desperate to find a new home. Following their ancestor's star maps, they discovered the greatest treasure of a past age - a world terraformed and prepared for human life.\r\nBut all is not right in this new Eden. The planet is not waiting for them, pristine and unoccupied. New monsters have turned it from a refuge into mankind's worst nightmare. Now two civilisations are on a collision course and must fight to survive. As the fate of humanity hangs in the balance, who are the true heirs of this new Earth?"
    },
    {
      "title": "Bad Actors",
      "author": "Mick Herron",
      "openlibrary_key": "OL25467179W",
      "date_read": "2024-10-20",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "Slough House",
      "author": "Mick Herron",
      "openlibrary_key": "OL22372492W",
      "date_read": "2024-10-17",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "Joe Country",
      "author": "Mick Herron",
      "openlibrary_key": "OL20989449W",
      "date_read": "2024-10-14",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "London Rules",
      "author": "Mick Herron",
      "openlibrary_key": "OL28803314W",
      "date_read": "2024-10-10",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "Spook Street",
      "author": "Mick Herron",
      "openlibrary_key": "OL20050194W",
      "date_read": "2024-10-04",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": "\"What happens when an old spook starts to lose his mind? Do the Services have a retirement home for people who know too many secrets but don't remember they're secrets? Or does someone come to take care of the senile spy for good? These are the questions River Cartwright must ask himself as his grandfather--David Cartwright, a Cold War-era operative--starts to forget to wear pants, and starts believing everyone in his life is someone sent by Services to watch him. However, River has other things to worry about. A bomb goes off in the middle of a flash mob performance in a busy shopping center and kills forty innocent civilians. The agents of Slough House have to figure out who is behind this act of terror before the situation escalates\"--"
    },
    {
      "title": "Real Tigers",
      "author": "Mick Herron",
      "openlibrary_key": "OL20019080W",
      "date_read": "2024-10-01",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "Dead Lions",
      "author": "Mick Herron",
      "openlibrary_key": "OL21263940W",
      "date_read": "2024-09-27",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": "328 pages ; 20 cm"
    },
    {
      "title": "Slow Horses",
      "author": "Mick Herron",
      "openlibrary_key": "OL18630860W",
      "date_read": "2024-09-15",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": "Slough House is Jackson Lamb's kingdom; a dumping ground for members of the intelligence service who've screwed up: left a secret file on a train, blown a surveillance, or become drunkenly unreliable. They're the service's poor relations - the slow horses - and bitterest among them is River Cartwright, whose days are spent transcribing mobile phone conversations. But when a young man is abducted, and it's threatened that he'll be beheaded live on the Internet, River sees an opportunity to redeem himself. Is the victim who he first appears to be? And what's the kidnappers' connection with a disgraced journalist? As the clock ticks on the execution, River finds that everyone involved has their own agenda ..."
    },
    {
      "title": "Sharpe’s Fury",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23268W",
      "date_read": "2024-08-13",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "August 22, 2006",
      "description": "For more than twenty years, Richard Sharpe, the brave and dashing officer who rose from rags on the street to a commission in his majesty's army, has been thrilling audiences on both the page and on screen. Now the incomparable Bernard Cornwell (\"the greatest writer of historical novels today\"*) returns with a thrilling new installment—the first new Sharpe novel in more than two years.The year is 1811. With the British army penned into a small part of Portugal, and all of Spain fallen to the invader except for the coastal city of Cadiz, the French appear to have won their war. Captain Richard Sharpe has no business being in Cadiz, but when an attack on a French-held bridge goes disastrously wrong, Sharpe—accompanied by Harper, his loyal Irish sergeant, and the obnoxious Brigadier Moon—finds himself in a city under French siege. It is also a town riven by political rivalry. Some Spaniards believe their country's future would be best served if they broke their alliance with Britain and forged a friendship with Napoleon's France; their cause is only strengthened when some letters written to a prostitute by the British ambassador fall into their possession. They resort to blackmail, and Sharpe, raised in the gutters of London and taught to fight, is released into the alleys of Cadiz to find the woman and retrieve the letters.Yet defeating the blackmailers will not save the city. That is up to the charismatic Scotsman, Sir Thomas Graham, who takes a small British force o attack the French siege lines. The attack goes horribly wrong; Sir Thomas's outnumbered army is trapped between the devil and the deep blue sea, and on a March morning, at Barrosa, Richard Sharpe finds himself embroiled in one of the most desperate infantry struggles ever fought. Sir Thomas has his own reasons for revenge, as does Sharpe, who goes into battle seeking the French colonel who precipitated the disaster that stranded Sharpe in Cadiz. In a bloody and stirring battle, Sharpe and the English get their revenge and their victory, but at a terrible cost. A triumph of both historical and battle fiction, Sharpe's Fury will sweep both old and new Sharpe fans into their hero's incredible adventures."
    },
    {
      "title": "Sharpe’s Escape",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23291W",
      "date_read": "2024-08-11",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "2004",
      "description": "It is 1810, and in Napoleon's determination to conquer Portugal -- and push the British back to the sea -- he sends his largest army yet across the Spanish frontier. But between the Portuguese border and Napoleon's seemingly certain victory are twoobstacles -- a wasted land, stripped of food by Wellington's orders, and Captain Richard Sharpe.But Sharpe is in trouble. The captain of the Light Company is threatened from inside and out: First by an incompetent British officer, who by virtue of family connections is temporarily given Sharpe's command. An even greater danger is posed by two corrupt Portuguese brothers -- Major Ferreira, a high-ranking officer in the army of Portugal, and his brother, nicknamed \"Ferragus\" (after a legen-dary Portuguese giant), who makes no claims to respectability, preferring instead to rule by crude physical strength and pure intimidation. Together the brothers have developed a devious plot to ingratiate themselves with the French invaders who are threatening to become Portugal's new rulers.Sharpe's interference in the first stage of their plan earns the undying enmity of the brothers. Ferragus vows revenge and plots a merciless trap that seems certain to kill Sharpe and his intimates -- battle-tested ally Sergeant Harper, the Portuguese officer Jorge Vicente, and a prickly but lovely English governess. As the city of Coimbra is burned and pillaged, Sharpe and his companions plot a daring escape, ensuring that Ferragus will follow on toward Lisbon, into the jaws of a snare laid by Wellington -- the massive lines of Torres Vedras, a daring and ingenious last stand against the invaders. There, beneath the British guns, Sharpe is reunited with his shattered but grateful company, and meets his enemies in a thrilling and decisive fight.Sharpe's Escape emphatically reaffirms Bernard Cornwell's status as \"perhaps the greatest writer of historical adventure novels today\" (Washington Post); its climactic battle scenes and evocative re-creation of history sweep the reader off the page and into the action and drama of nineteenth-century warfare."
    },
    {
      "title": "Sharpe’s Gold",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23314W",
      "date_read": "2024-08-08",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1981",
      "description": "Bold, professional, ruthless - hero and man of actionThe stench was thick by the hermitage and buzzing with flies, and Sharpe paused by the steps.There was almost a reluctance to go inside, not just because of the bodies but because of what the hermitage might not contain.The gold.Fresh from battle and covered in glory, Sharpe and his regiment are called north by Wellington.On arrival though Sharpe is set on a desperate mission–to go behind enemy lines and secure the gold so vital to the success of the war.Success means riches–not just for the army, but for Sharpe and his men.The enemy he faces strikes terror in to the hearts of all around –a renegade guerrilla band whose leader has a particular loathing for Sharpe who has stolen his woman."
    },
    {
      "title": "Sharpe’s Eagle",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23305W",
      "date_read": "2024-08-05",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1981",
      "description": "Bold, professional, ruthless - hero and man of action\"Sharpe asked three things of his men. That they fought as he did with a ruthless professionalism.That they stole only from the enemy and the dead unless they were starving. And they never got drunk without his permission.\"Richard Sharpe is having a difficult war. Excluded from promotion because he is always on the battlefield, up against pompous, incompetent colonels, and worst, suddenly finding himself at the head of an inexperienced company who use all twenty five drill book approved movements to load and fire their muskets.A soldier like Sharpe can't be kept down though and his promotion to Captain, when it comes, makes a dangerous enemy in the upper ranks. As Sharpe approaches bloody battle in Talavera, he knows he is fighting for his own honour and that of his men."
    },
    {
      "title": "Sharpe’s Havoc",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23298W",
      "date_read": "2024-08-01",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "2003",
      "description": "Bestselling historical novelist Bernard Cornwell returns to the battlefields of the Iberian Peninsula with Sharpe's Havoc, where the lieutenant and his men bravely fight the French invasion into Portugal.It is 1809, a few years after Lieutenant Richard Sharpe's heroic exploits on the battlefields of India and at Trafalgar, and Sharpe finds himself fighting the savage armies of Napoleon Bonaparte as they try to bring the whole of the Iberian Peninsula under their control. Napoleon is advancing fast in northern Portugal, and no one knows whether the small contingent of British troops stationed in Lisbon will stay to fight or sail back to England. Sharpe, however, does not have a choice: He and his squad of riflemen are on the lookout for the missing daughter of an English wine shipper, when the French onslaught begins and the city of Oporto becomes a setting for carnage and disaster.Stranded behind enemy lines, Sharpe returns to his mission to find Kate Savage. Sharpe's position on enemy grounds is precarious, and his search is further complicated by a mysterious and threatening Englishman, Colonel Christopher, who has his own ideas on how the French can be driven from Portugal. Christopher's scheme is dangerous, and Sharpe and his Riflemen are the only obstacles standing in his way. Suddenly, a newly arrived British commander in Lisbon, Sir Arthur Wellesley, unknowingly comes to Sharpe's rescue. Just when Sharpe and his men seem doomed, Sir Arthur mounts his own counterattack, an operation of breathtaking daring that will send Marshal Soult's army reeling back into the northern mountains.Sharpe's Havoc is a classic Sharpe story, based on real history, and a return to Portugal in the company of Sergeant Patrick Harper, Captain Hogan, and Sharpe's beloved Green-jackets, who can turn a battle as fast as Cornwell's readers can turn a page."
    },
    {
      "title": "Sharpe’s Rifles",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23292W",
      "date_read": "2024-07-31",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1988",
      "description": "As if being cut off from the army and surrounded by enemy cavalry is not bad enough, this officer who in the eyes of his society does not belong to his rank, Richard Sharpe has to deal with mutinous soldiers as well! It is only when he meets with a band of partisans that things become tolerable at best. Bolstered by his new allies and with his country having no faith in eventually winning against Napoleon in the peninsular war, 1807-1814, Sharpe and his elite riflemen with the partisans help plan an ambitious mission to give Spain hope and snatch victory from disaster, which is borderline crazy but could work.. If you believe in superstition."
    },
    {
      "title": "Sharpe’s Prey",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23252W",
      "date_read": "2024-07-30",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "2002",
      "description": "The eighteenth novel in this bestselling series takes Sharpe to battle in Copenhagen.It is 1807 and Lieutenant Richard Sharpe, newly returned to England, now wants to leave the army. He is offered one last job: go to Copenhagen, help deliver a bribe and so stop a war. It seems very easy.But nothing is easy in a Europe stirred by French ambitions. The Danes possess a battle fleet that could replace every ship the French lost at Trafalgar, and Napoleon's forces are gathering to take it. The British have to stop them, while the Danes insist on remaining neutral.Sharpe was not sent to Copenhagen to dabble in high politics – he is there to employ the skills he learned on the streets of London's slums. Dragged into a war of spies and brutality, Sharpe finds that he is a sacrificial pawn. But pawns can sometimes change the game, and Sharpe makes his own rules. When he discovers a traitor in his midst, he becomes a hunter in a city besieged by British troops.Copenhagen is doomed. In three nights of horror, as the city burns, Sharpe must protect a woman, find his traitor, and stay alive."
    },
    {
      "title": "Sharpe’s Trafalgar",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23302W",
      "date_read": "2024-07-29",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "2000",
      "description": "PerfectBound e-book exclusive extra: \"Sharpe's Skirmish: Richard Sharpe and The Defence of Tormes, August 1812,\" a short story.Sharpe's Trafalgar is a dazzling nautical adventure that finds ensign Richard Sharpe in the middle of one of history's most spectacular naval engagements: the battle at Cape Trafalgar off the coast of Spain, in 1805."
    },
    {
      "title": "Sharpe’s Fortress",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23315W",
      "date_read": "2024-07-27",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1999",
      "description": "Promoted for his gallantry in the war against India's rebellious Mahratta confederacy, Richard Sharpe is uncomfortable with his newfound authority -- and embroiled in his own private campaign. The unmistakable scent of treason is leading him to Gawilghur, an impenetrable fortress in the sky and the last refuge of desperate enemies of all dark stripes. And as the army of Sir Arthur Wellesley, the future Duke of Wellington, prepares to lay siege to the stronghold high above the Deccan Plain, Sharpe will risk his honor, reputation, and fortune on a battle that will test him as never before."
    },
    {
      "title": "Sharpe’s Triumph",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23317W",
      "date_read": "2024-07-22",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1998",
      "description": "E-book Extras: Bernard Cornwell On: The Origin of Richard Sharpe; Sharpe's Adventures; Sharpe's Trafalgar.The next installment in Bernard Cornwell’s wildly popular Sharpe series.Richard Sharpe and the Battle of Assaye, September 1803It is India, 1803. In the four years since he earned his sergeant's stripes, young Richard Sharpe has led a relatively peaceful existence.  But Sharpe's reverie ends when he barely survives a murderous act of treason by a bitter English officer who has joined the mercenary forces of the Mahratta confederation, determined to drive the British from the continent.  Vowing to hunt down the turncoat, Sharpe plunges headlong into the white-hot battle of Assaye alongside Sir Arthur Wellesley -- the future of Duke of Wellington -- in the fiercest fight of his career.  Sharpe's Triumph is a riveting story of betrayal and revenge that showcases the deft blend of suspenseful military adventure and sweeping historical detail that has made Bernard Corwell's books bestsellers around the world."
    },
    {
      "title": "Sharpe’s Tiger",
      "author": "Bernard Cornwell",
      "openlibrary_key": "OL23309W",
      "date_read": "2024-07-18",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1997",
      "description": "In a battery of events that will make a hero out of an illiterate private, a young Richard Sharpe poses as the enemy to bring down a ruthless Indian dictator backed by fearsome French troops.The year is 1799, and Richard Sharpe is just beginning his military career. An inexperienced young private in His Majesty's service, Sharpe becomes part of an expedition to India to push the ruthless Tippoo of Mysore from his throne and drive out his French allies. To penetrate the Tippoo's city and make contact with a Scottish spy being held prisoner there, Sharpe has to pose as a deserter. Success will make him a sergeant, but failure will turn him over to the Tippoo's brutal executioners — or, worse — his man-eating tigers. Picking his way through an exotic and alien world. Sharpe realizes that one slip will mean disaster. And when the furious British assault on the city finally begins, Sharpe must take up arms against his true comrades to preserve his false identity, risking death at their hands in order to avoid detection and thus to foil the Tippoo's well-set trap."
    },
    {
      "title": "Whirlwind",
      "author": "James Clavell",
      "openlibrary_key": "OL2918754W",
      "date_read": "2024-06-30",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1986",
      "description": ""
    },
    {
      "title": "Noble House",
      "author": "James Clavell",
      "openlibrary_key": "OL15649560W",
      "date_read": "2024-06-18",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "Set in Hong Kong in 1963. The Noble House is in financial trouble and the fate of Hong Kong rests on what will happen to it."
    },
    {
      "title": "King Rat",
      "author": "James Clavell",
      "openlibrary_key": "OL16028991W",
      "date_read": "2024-06-07",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": ""
    },
    {
      "title": "Gai-Jin",
      "author": "James Clavell",
      "openlibrary_key": "OL2918757W",
      "date_read": "2024-05-12",
      "favourite": false,
      "genres": [
        "Historical Fiction",
        "Japan"
      ],
      "first_publish_date": "1993",
      "description": "The heir to the magnificent English trading company, the Noble House…the direct descendant of the first Toranaga Shogun battling to usher his country into the modern age…a beautiful young French woman forever torn between ambition and desire…Their lives intertwine in an exotic land newly open to foreigners, gai-jin, torn apart by greed, idealism, and terrorism. Their passions mingle with monarchs and diplomats, assassins, courtesans and spies. Their fates collide in James Clavell’s latest masterpiece set in nineteenth-century Japan–an unforgettable epic seething with betrayal and secrets, brutality and heroism, love and forbidden passions.…"
    },
    {
      "title": "Tai-Pan",
      "author": "James Clavell",
      "openlibrary_key": "OL2918760W",
      "date_read": "2024-05-06",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1966",
      "description": "\"It is the early 19th century, when European traders and adventurers first began to penetrate the forbidding Chinese mainland. And it is in this exciting time and exotic place that a giant of an Englishman, Dirk Straun, sets out to turn the desolate island of Hong Kong into an impregnable fortress of British power, and to make himself supreme ruler-- Tai-Pan!\"--P. [4] of cover."
    },
    {
      "title": "Shōgun",
      "author": "James Clavell",
      "openlibrary_key": "OL2918756W",
      "date_read": "2024-04-24",
      "favourite": true,
      "genres": [
        "Historical Fiction",
        "Japan"
      ],
      "first_publish_date": "1975",
      "description": "After Englishman John Blackthorne is lost at sea, he awakens in a place few Europeans know of and even fewer have seen--Nippon. Thrust into the closed society that is seventeenth-century Japan, a land where the line between life and death is razor-thin, Blackthorne must negotiate not only a foreign people, with unknown customs and language, but also his own definitions of morality, truth, and freedom. As internal political strife and a clash of cultures lead to seemingly inevitable conflict, Blackthorne's loyalty and strength of character are tested by both passion and loss, and he is torn between two worlds that will each be forever changed.\r\n\r\nPowerful and engrossing, capturing both the rich pageantry and stark realities of life in feudal Japan, Shōgun is a critically acclaimed powerhouse of a book. Heart-stopping, edge-of-your-seat action melds seamlessly with intricate historical detail and raw human emotion. Endlessly compelling, this sweeping saga captivated the world to become not only one of the best-selling novels of all time but also one of the highest-rated television miniseries, as well as inspiring a nationwide surge of interest in the culture of Japan. Shakespearean in both scope and depth, Shōgun is, as the New York Times put it, \"...not only something you read--you live it.\" Provocative, absorbing, and endlessly fascinating, there is only one: Shōgun."
    },
    {
      "title": "The Butcher of Anderson Station",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL24622313W",
      "date_read": "2024-04-23",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Drive",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL24622294W",
      "date_read": "2024-04-22",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Leviathan Falls",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL25326790W",
      "date_read": "2024-04-17",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Tiamat's Wrath",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL19800273W",
      "date_read": "2024-04-10",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Tiamat's Wrath is a science fiction novel by James S. A. Corey, the pen name of Daniel Abraham and Ty Franck, and the eighth book in their series The Expanse. Following the series' tradition of referring to ancient mythology in its titles, the book's title references the Babylonian goddess Tiamat who took part in the creation of the universe."
    },
    {
      "title": "Persepolis Rising",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL24234814W",
      "date_read": "2024-04-04",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Babylon's Ashes",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL19099155W",
      "date_read": "2024-03-29",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Nemesis Games",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL17755458W",
      "date_read": "2024-03-19",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Cibola Burn",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL17454175W",
      "date_read": "2024-03-13",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Abaddon's Gate",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL17074648W",
      "date_read": "2024-03-06",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "Caliban's War",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL16117275W",
      "date_read": "2024-02-28",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "The second book in the NYT best-selling Expanse series, Caliban's War shows a solar system on the brink of war, and the only hope of peace rests on James Holden and the crew of the Rocinante's shoulders. Now a Prime Original series.\r\n\r\nWe are not alone.\r\n\r\nOn Ganymede, breadbasket of the outer planets, a Martian marine watches as her platoon is slaughtered by a monstrous supersoldier. On Earth, a high-level politician struggles to prevent interplanetary war from reigniting. And on Venus, an alien protomolecule has overrun the planet, wreaking massive, mysterious changes and threatening to spread out into the solar system.\r\n\r\nIn the vast wilderness of space, James Holden and the crew of the Rocinante have been keeping the peace for the Outer Planets Alliance. When they agree to help a scientist search war-torn Ganymede for a missing child, the future of humanity rests on whether a single ship can prevent an alien invasion that may have already begun..."
    },
    {
      "title": "Leviathan Wakes",
      "author": "James S. A. Corey",
      "openlibrary_key": "OL16114008W",
      "date_read": "2024-02-19",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "When Captain Jim Holden's ice miner stumbles across a derelict, abandoned ship, he uncovers a secret that threatens to throw the entire system into war. Attacked by a stealth ship belonging to the Mars fleet, Holden must find a way to uncover the motives behind the attack, stop a war and find the truth behind a vast conspiracy that threatens the entire human race."
    },
    {
      "title": "Dust",
      "author": "Hugh Howey",
      "openlibrary_key": "OL17623070W",
      "date_read": "2024-02-11",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Armed with secret knowledge, Juliette, now mayor of Silo 18 and her crew set out to rescue a world she hates but now understands better -- the world of the Silos with its rigid rules and terrible consequences for disobedience."
    },
    {
      "title": "Shift",
      "author": "Hugh Howey",
      "openlibrary_key": "OL17366206W",
      "date_read": "2024-02-04",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "In a future less than 50 years away, the world is still as we know it. Time continues to tick by. The truth is that it is ticking away. A powerful few know what lies ahead. They are preparing for it. They are trying to protect us. They are setting us on a path from which we can never return. A path that will lead to destruction; a path that will take us below ground. The history of the silo is about to be written. Our future is about to begin."
    },
    {
      "title": "Wool",
      "author": "Hugh Howey",
      "openlibrary_key": "OL16800608W",
      "date_read": "2024-01-23",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "They live beneath the earth in a prison of their own making. There is a view of the outside world, a spoiled and rotten world, their forefathers left behind. But this view fades over time, ruined by the toxic airs that kill any who brave them.\r\n\r\nSo they leave it to the criminals, those who break the rules, and who are sent to cleaning. Why do they do it, these people condemned to death? Sheriff Holston has always wondered. Now he is about to find out."
    },
    {
      "title": "Reliable Essays",
      "author": "Clive James",
      "openlibrary_key": "OL2738807W",
      "date_read": "2024-01-14",
      "favourite": false,
      "genres": [
        "Essays",
        "Non-Fiction"
      ],
      "first_publish_date": "December 31, 2002",
      "description": ""
    },
    {
      "title": "A to Z of The Designers Republic",
      "author": "Ian Anderson",
      "openlibrary_key": "OL36047221W",
      "date_read": "2023-12-20",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Gardening Book",
      "author": "Monty Don",
      "openlibrary_key": "OL34030768W",
      "date_read": "2023-11-24",
      "favourite": false,
      "genres": [
        "Gardening",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Wandering Earth",
      "author": "Cixin Liu",
      "openlibrary_key": "OL17862728W",
      "date_read": "2023-05-04",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Collection of short stories."
    },
    {
      "title": "Death's End",
      "author": "Cixin Liu",
      "openlibrary_key": "OL17610507W",
      "date_read": "2023-04-29",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Soon to be a Netflix Original Series!\r\n\r\n“The War of the Worlds for the 21st century… packed with a sense of wonder.” – Wall Street Journal\r\n\r\nThe New York Times bestselling conclusion to a tour de force near-future adventure trilogy from China's bestselling and beloved science fiction writer.\r\n\r\nWith The Three-Body Problem, English-speaking readers got their first chance to read China's most beloved science fiction author, Cixin Liu. The Three-Body Problem was released to great acclaim including coverage in The New York Times and The Wall Street Journal and reading list picks by Barack Obama and Mark Zuckerberg. It was also won the Hugo and Nebula Awards, making it the first translated novel to win a major SF award.\r\n\r\nNow this epic trilogy concludes with Death's End. Half a century after the Doomsday Battle, the uneasy balance of Dark Forest Deterrence keeps the Trisolaran invaders at bay. Earth enjoys unprecedented prosperity due to the infusion of Trisolaran knowledge. With human science advancing daily and the Trisolarans adopting Earth culture, it seems that the two civilizations will soon be able to co-exist peacefully as equals without the terrible threat of mutually assured annihilation. But the peace has also made humanity complacent.\r\n\r\nCheng Xin, an aerospace engineer from the early twenty-first century, awakens from hibernation in this new age. She brings with her knowledge of a long-forgotten program dating from the beginning of the Trisolar Crisis, and her very presence may upset the delicate balance between two worlds. Will humanity reach for the stars or die in its cradle?"
    },
    {
      "title": "The Dark Forest",
      "author": "Cixin Liu",
      "openlibrary_key": "OL26744171W",
      "date_read": "2023-03-25",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Three-Body Problem",
      "author": "Cixin Liu",
      "openlibrary_key": "OL17267881W",
      "date_read": "2023-01-29",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Cixin Liu's trilogy-opening novel about first contact with aliens and the clandestine struggle with them over Earth's future, and its scientific progress in particular.\r\n\r\nSet against the backdrop of China's Cultural Revolution, a secret military prject sends signals into space in an attempt to make contact with aliens—and they succeed. An alien civilization on the brink of descruction captures the signal and plans to invade Earth. Now, on Earth, different camps start forming, planning to either welcome the superior beings and help them take over a world seen as corrupt, or fight against the invasion. The result is a science fiction masterpiece of enormous scope and vision."
    },
    {
      "title": "The Shards",
      "author": "Bret Easton Ellis",
      "openlibrary_key": "OL27915771W",
      "date_read": "2023-01-13",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "description": ""
    },
    {
      "title": "Pachinko",
      "author": "Min Jin Lee",
      "openlibrary_key": "OL17762217W",
      "date_read": "2022-12-26",
      "favourite": true,
      "genres": [
        "Fiction",
        "Japan"
      ],
      "description": "In the early 1900s, teenaged Sunja, the adored daughter of a crippled fisherman, falls for a wealthy stranger at the seashore near her home in Korea. He promises her the world, but when she discovers she is pregnant--and that her lover is married--she refuses to be bought. Instead, she accepts an offer of marriage from a gentle, sickly minister passing through on his way to Japan. But her decision to abandon her home, and to reject her son's powerful father, sets off a dramatic saga that will echo down through the generations.\r\n\r\nRichly told and profoundly moving, Pachinko is a story of love, sacrifice, ambition, and loyalty. From bustling street markets to the halls of Japan's finest universities to the pachinko parlors of the criminal underworld, Lee's complex and passionate characters--strong, stubborn women, devoted sisters and sons, fathers shaken by moral crisis--survive and thrive against the indifferent arc of history."
    },
    {
      "title": "We Own This City",
      "author": "Justin Fenton",
      "openlibrary_key": "OL20911098W",
      "date_read": "2022-12-21",
      "favourite": false,
      "genres": [
        "Crime",
        "History",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Tokyo Vice",
      "author": "Jake Adelstein",
      "openlibrary_key": "OL17516102W",
      "date_read": "2022-11-28",
      "favourite": false,
      "genres": [
        "Crime",
        "Japan",
        "Memoir",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Siddhartha",
      "author": "Hermann Hesse",
      "openlibrary_key": "OL872932W",
      "date_read": "2022-11-20",
      "favourite": false,
      "genres": [
        "Fiction",
        "Philosophy",
        "Spirituality"
      ],
      "description": "Hermann Hesse wrote Siddhartha after he traveled to India in the 1910s. It tells the story of a young boy who travels the country in a quest for spiritual enlightenment in the time of Guatama Buddha. It is a compact, lyrical work, which reads like an allegory about the finding of wisdom."
    },
    {
      "title": "SAS: Rogue Heroes",
      "author": "Ben Macintyre",
      "openlibrary_key": "OL20036147W",
      "date_read": "2022-11-03",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction"
      ],
      "description": "Britain's Special Air Service--or SAS--was the brainchild of David Stirling, a young, gadabout aristocrat with a remarkable strategic mind. Where his colleagues looked at a map of World War II's African theater and saw a protracted struggle with Rommel's desert forces, Stirling saw an opportunity: given a small number of elite, well-trained men, he could parachute behind Nazi lines and sabotage their airplanes and supplies. Paired with his constitutional opposite, the disciplined martinet Jock Lewes, Stirling assembled a revolutionary fighting force that would upend not just the balance of the war, but the nature of combat itself. He faced no little resistance from those who found his tactics ungentlemanly or beyond the pale, but in the SAS's remarkable exploits facing the Nazis in the Africa and then on the Continent can be found the seeds of nearly all special forces units that would follow. Bringing his keen eye for psychological detail to a riveting wartime narrative, Ben Macintyre uses his unprecedented access to SAS archives to shine a light inside a legendary unit long shrouded in secrecy. The result is not just a tremendous war story, but a fascinating group portrait of men of whom history and country asked the most.--Publisher description."
    },
    {
      "title": "PIHKAL",
      "author": "Alexander Shulgin",
      "openlibrary_key": "OL8799025W",
      "date_read": "2022-08-31",
      "favourite": false,
      "genres": [
        "Memoir",
        "Philosophy",
        "Psychedelics",
        "Psychology",
        "Science",
        "Spirituality"
      ],
      "description": ""
    },
    {
      "title": "A Really Good Day",
      "author": "Ayelet Waldman",
      "openlibrary_key": "OL20043574W",
      "date_read": "2022-08-26",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction",
        "Psychedelics",
        "Psychology",
        "Self-Help"
      ],
      "description": "\"In an effort to treat a debilitating mood disorder, Ayelet Waldman undertook a very private experiment, ingesting 10 micrograms of LSD every three days for a month. This is the story--by turns revealing, courageous, fascinating and funny--of her quietly psychedelic spring, her quest to understand one of our most feared drugs, and her search for a really good day\"--"
    },
    {
      "title": "The Teachings of Don Juan",
      "author": "Carlos Castaneda",
      "openlibrary_key": "OL1884562W",
      "date_read": "2022-08-13",
      "favourite": false,
      "genres": [
        "Philosophy",
        "Spirituality"
      ],
      "first_publish_date": "February 22, 1990",
      "description": ""
    },
    {
      "title": "DMT",
      "author": "Rick Strassman",
      "openlibrary_key": "OL8624266W",
      "date_read": "2022-08-04",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Psychedelics",
        "Science",
        "Spirituality"
      ],
      "description": ""
    },
    {
      "title": "The Cosmic Serpent",
      "author": "Jeremy Narby",
      "openlibrary_key": "OL2717593W",
      "date_read": "2022-07-22",
      "favourite": false,
      "genres": [
        "Philosophy",
        "Psychedelics",
        "Spirituality"
      ],
      "first_publish_date": "1998",
      "description": "For ten years, Jeremy Narby explored the Amazonian rain forests, the libraries of Europe, and some of the world's most arcane scientific journals, following strange clues, unsuppressible intuitions, and extraordinary coincidences. He collected evidence and researched the seemingly impossible possibility that specific knowledge might somehow be transferred through DNA, the genetic information at the heart of every cell of every living thing, to a specially prepared consciousness.\n\nNarby demonstrates that indigenous and ancient peoples have known for millennia - and have even drawn - the double helix structure, something Western science discovered only in 1953. He also suggests that DNA and the life it codes for at the cellular level are \"minded.\""
    },
    {
      "title": "Good Pop, Bad Pop",
      "author": "Jarvis Cocker",
      "openlibrary_key": "OL25778840W",
      "date_read": "2022-07-19",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Supernatural",
      "author": "Graham Hancock",
      "openlibrary_key": "OL18821896W",
      "date_read": "2022-07-18",
      "favourite": false,
      "genres": [
        "Psychedelics",
        "Spirituality"
      ],
      "description": ""
    },
    {
      "title": "The Psychedelic Experience",
      "author": "Timothy Leary",
      "openlibrary_key": "OL20947505W",
      "date_read": "2022-07-17",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Philosophy",
        "Psychedelics",
        "Psychology",
        "Spirituality"
      ],
      "description": ""
    },
    {
      "title": "The Psychedelic Explorer's Guide",
      "author": "James Fadiman",
      "openlibrary_key": "OL16414044W",
      "date_read": "2022-07-12",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Philosophy",
        "Psychedelics",
        "Self-Help",
        "Spirituality"
      ],
      "description": "\"Psychedelics for spiritual, therapeutic, and problem-solving use\"--Provided by publisher."
    },
    {
      "title": "Be Here Now",
      "author": "Ram Dass",
      "openlibrary_key": "OL17344224W",
      "date_read": "2022-07-12",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Philosophy",
        "Psychology",
        "Self-Help",
        "Spirituality"
      ],
      "description": ""
    },
    {
      "title": "Food Of The Gods",
      "author": "Terence McKenna",
      "openlibrary_key": "OL8353432W",
      "date_read": "2022-06-18",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction",
        "Philosophy",
        "Psychedelics",
        "Psychology"
      ],
      "description": ""
    },
    {
      "title": "Entangled Life",
      "author": "Merlin Sheldrake",
      "openlibrary_key": "OL20758206W",
      "date_read": "2022-06-08",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Science"
      ],
      "description": ""
    },
    {
      "title": "How to Change Your Mind",
      "author": "Michael Pollan",
      "openlibrary_key": "OL20159801W",
      "date_read": "2022-06-04",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Psychedelics",
        "Psychology",
        "Self-Help"
      ],
      "description": "When Michael Pollan set out to research how LSD and psilocybin (the active ingredient in magic mushrooms) are being used to provide relief to people suffering from difficult-to-treat conditions such as depression, addiction and anxiety, he did not intend to write what is undoubtedly his most personal book. But upon discovering how these remarkable substances are improving the lives not only of the mentally ill but also of healthy people coming to grips with the challenges of everyday life, he decided to explore the landscape of the mind in the first person as well as the third. Thus began a singular adventure into various altered states of consciousness, along with a dive deep into both the latest brain science and the thriving underground community of psychedelic therapists. Pollan sifts the historical record to separate the truth about these mysterious drugs from the myths that have surrounded them since the 1960s, when a handful of psychedelic evangelists inadvertently catalyzed a powerful backlash against what was then a promising field of research."
    },
    {
      "title": "Junky",
      "author": "William S. Burroughs",
      "openlibrary_key": "OL21013804W",
      "date_read": "2022-05-31",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Great Shark Hunt",
      "author": "Hunter S. Thompson",
      "openlibrary_key": "OL18165912W",
      "date_read": "2022-05-13",
      "favourite": false,
      "genres": [
        "Essays",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Rock Bottom",
      "author": "Michael Odell",
      "openlibrary_key": "OL25710165W",
      "date_read": "2022-05-03",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "1 online resource (212 pages)"
    },
    {
      "title": "The Doors of Perception",
      "author": "Aldous Huxley",
      "openlibrary_key": "OL276254W",
      "date_read": "2022-04-30",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction",
        "Philosophy",
        "Psychedelics",
        "Psychology"
      ],
      "first_publish_date": "September 2, 2004",
      "description": ""
    },
    {
      "title": "The Circle",
      "author": "Dave Eggers",
      "openlibrary_key": "OL16808654W",
      "date_read": "2022-03-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "The Circle is a 2013 dystopian novel written by American author Dave Eggers. The novel chronicles tech worker Mae Holland as she joins a powerful Internet company. Her initially rewarding experience turns darker."
    },
    {
      "title": "American Prometheus",
      "author": "Kai Bird",
      "openlibrary_key": "OL1905682W",
      "date_read": "2022-02-20",
      "favourite": false,
      "genres": [
        "Biography",
        "History",
        "Non-Fiction",
        "Science"
      ],
      "first_publish_date": "2005",
      "description": "Biography of American physicist Robert J. Oppenheimer. Winner of the 2006 Pulitzer Prize for Biography or Autobiography."
    },
    {
      "title": "Fear and Loathing in Las Vegas",
      "author": "Hunter S. Thompson",
      "openlibrary_key": "OL158041W",
      "date_read": "2022-02-17",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "April 4, 2005",
      "description": "Maverick author Hunter S. Thompson introduced the world to \"gonzo journalism\" with this cult classic that shot back up the best seller lists after Thompson's suicide in 2005. No book ever written has more perfectly captured the spirit of the 1960s counterculture. In Las Vegas to cover a motorcycle race, Raoul Duke (Thompson) and his attorney Dr. Gonzo (inspired by a friend of Thompson) are quickly diverted to search for the American dream. Their quest is fueled by nearly every drug imaginable and quickly becomes a surreal experience that blurs the line between reality and fantasy. But there is more to this hilarious tale than reckless behavior, for underneath the hallucinogenic facade is a stinging criticism of American greed and consumerism."
    },
    {
      "title": "I, Robot",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46241W",
      "date_read": "2022-01-16",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "I, Robot is a fixup novel of science fiction short stories or essays by American writer Isaac Asimov. The stories originally appeared in the American magazines Super Science Stories and Astounding Science Fiction between 1940 and 1950 and were then compiled into a book for stand-alone publication by Gnome Press in 1950, in an initial edition of 5,000 copies. The stories are woven together by a framing narrative in which the fictional Dr. Susan Calvin tells each story to a reporter (who serves as the narrator) in the 21st century. Although the stories can be read separately, they share a theme of the interaction of humans, robots, and morality, and when combined they tell a larger story of Asimov's fictional history of robotics.\r\n\r\n\r\n----------\r\n\r\nContains:\r\n\"Introduction\" \r\n\"Robbie\" (1940, 1950)\r\n\"Runaround\" (1942)\r\n\"Reason\" (1941)\r\n\"Catch That Rabbit\" (1944)\r\n\"Liar!\" (1941)\r\n\"Little Lost Robot\" (1947)\r\n\"Escape!\" (1945)\r\n\"Evidence\" (1946)\r\n\"The Evitable Conflict\" (1950)"
    },
    {
      "title": "Prelude to Foundation",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46172W",
      "date_read": "2022-01-06",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Voici une occasion tant pour ceux qui ont lu les cinq volumes du cycle ##Fondation## d'en constater la prȟistoire, que pour ceux qui ne les ont pas lus d'inaugurer la lecture d'un des chefs-d'oeuvre de la science-fiction contemporaine. [SDM]."
    },
    {
      "title": "Foundation’s Edge",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46347W",
      "date_read": "2021-12-18",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Golan Trevize, Janov Pelorat, Bliss go looking for earth."
    },
    {
      "title": "Second Foundation",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46309W",
      "date_read": "2021-12-12",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "After years of struggle, the Foundation lay in ruins -- destroyed by the mutant mind power of the Mule. But it was rumored that there was a Second Foundation hidden somewhere at the end of the Galaxy, established to preserve the knowledge of mankind through the long centuries of barbarism. The Mule had failed to find it the first time -- but now he was certain he knew where it lay.\r\n\r\nThe fate of the Foundation rests on young Arkady Darell, only fourteen years old and burdened with a terrible secret. As its scientists girded for a final showdown with the Mule, the survivors of the First Foundation began their desperate search. They too wanted the Second Foundation destroyed... before it destroyed them."
    },
    {
      "title": "The Fortress of Solitude",
      "author": "Jonathan Lethem",
      "openlibrary_key": "OL74405W",
      "date_read": "2021-11-28",
      "favourite": true,
      "genres": [
        "Fiction"
      ],
      "description": "This is the story of two boys, Dylan Ebdus and Mingus Rude. They are friends and neighbors, but because Dylan is white and Mingus is black, their friendship is not simple. This is the story of their Brooklyn neighborhood, which is almost exclusively black despite the first whispers of something that will become known as \"gentrification.\"\r\n\r\nThis is the story of 1970s America, a time when the most simple human decisions—what music you listen to, whether to speak to the kid in the seat next to you, whether to give up your lunch money—are laden with potential political, social and racial disaster. This is the story of 1990s America, when no one cared anymore.\r\n\r\nThis is the story of punk, that easy white rebellion, and crack, that monstrous plague. This is the story of the loneliness of the avant-garde artist and the exuberance of the graffiti artist.\r\n\r\nThis is the story of what would happen if two teenaged boys obsessed with comic book heroes actually had superpowers: They would screw up their lives.\r\n\r\nThis is the story of joyous afternoons of stickball and dreaded years of schoolyard extortion. This is the story of belonging to a society that doesn't accept you. This is the story of prison and of college, of Brooklyn and Berkeley, of soul and rap, of murder and redemption.\r\n\r\nThis is the story Jonathan Lethem was born to tell. This is THE FORTRESS OF SOLITUDE."
    },
    {
      "title": "Foundation and Empire",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46224W",
      "date_read": "2021-11-08",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Led by its founding father, the great psychohistorian Hari Seldon, and taking advantage of its superior science and technology, the Foundation has survived the greed and barbarism of its neighboring warrior-planets. Yet now it must face the Empire still the mightiest force in the Galaxy even in its death throes. When an ambitious general determined to restore the Empire's glory turns the vast Imperial fleet toward the Foundation, the only hope for the small planet of scholars and scientists lies in the prophecies of Hari Seldon."
    },
    {
      "title": "Foundation",
      "author": "Isaac Asimov",
      "openlibrary_key": "OL46125W",
      "date_read": "2021-09-06",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "One of the great masterworks of science fiction, the Foundation novels of Isaac Asimov are unsurpassed for their unique blend of nonstop action, daring ideas, and extensive world-building. \r\n\r\nThe story of our future begins with the history of Foundation and its greatest psychohistorian: Hari Seldon.  For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying.  Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future--a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save mankind, Seldon gathers the best minds in the Empire--both scientists and scholars--and brings them to a bleak planet at the edge of the Galaxy to serve as a beacon of hope for future generations. He calls his sanctuary the Foundation.\r\n\r\nBut soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind's last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves--or take a stand for freedom and risk total destruction."
    },
    {
      "title": "Klara and the Sun",
      "author": "Kazuo Ishiguro",
      "openlibrary_key": "OL20883297W",
      "date_read": "2021-09-06",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "\"Klara and the Sun, the first novel by Kazuo Ishiguro since he was awarded the Nobel Prize in Literature, tells the story of Klara, an Artificial Friend with outstanding observational qualities, who, from her place in the store, watches carefully the behavior of those who come in to browse, and of those who pass on the street outside. She remains hopeful that a customer will soon choose her.\r\n\r\nKlara and the Sun is a thrilling book that offers a look at our changing world through the eyes of an unforgettable narrator, and one that explores the fundamental question: what does it mean to love?\r\n\r\nIn its award citation in 2017, the Nobel committee described Ishiguro's books as \"novels of great emotional force\" and said he has \"uncovered the abyss beneath our illusory sense of connection with the world.\"\""
    },
    {
      "title": "Dune",
      "author": "Frank Herbert",
      "openlibrary_key": "OL893415W",
      "date_read": "2021-09-06",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the \"spice\" melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...\r\n\r\nWhen House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad'Dib, he will bring to fruition humankind's most ancient and unattainable dream.\r\n\r\nA stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction."
    },
    {
      "title": "Mallorca Marco Polo Pocket Travel Guide",
      "author": "Marco Polo",
      "openlibrary_key": "OL21154628W",
      "date_read": "2021-08-01",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Travel"
      ],
      "description": ""
    },
    {
      "title": "The Anatomy of Melancholy",
      "author": "Robert Burton",
      "openlibrary_key": "OL24647937W",
      "date_read": "2021-06-27",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Philosophy",
        "Psychology"
      ],
      "description": ""
    },
    {
      "title": "Excavate!",
      "author": "Tessa Norton",
      "openlibrary_key": "OL33805175M",
      "date_read": "2021-04-27",
      "favourite": false,
      "genres": [
        "Essays",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Any Human Heart",
      "author": "William Boyd",
      "openlibrary_key": "OL19827000W",
      "date_read": "2021-04-02",
      "favourite": true,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Fast Forward",
      "author": "Stephen Morris",
      "openlibrary_key": "OL21696968W",
      "date_read": "2021-01-05",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "I Wanna Be Yours",
      "author": "John Cooper Clarke",
      "openlibrary_key": "OL20846412W",
      "date_read": "2020-11-03",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction",
        "Poetry"
      ],
      "description": ""
    },
    {
      "title": "The 4 Pillar Plan",
      "author": "Dr Rangan Chatterjee",
      "openlibrary_key": "OL22325400W",
      "date_read": "2020-09-05",
      "favourite": false,
      "genres": [
        "Health",
        "Non-Fiction",
        "Self-Help"
      ],
      "description": ""
    },
    {
      "title": "Sing Backwards and Weep",
      "author": "Mark Lanegan",
      "openlibrary_key": "OL20757997W",
      "date_read": "2020-05-13",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Mirror and the Light",
      "author": "Hilary Mantel",
      "openlibrary_key": "OL20665410W",
      "date_read": "2020-02-24",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "The Mirror & The Light is a historical novel by English writer Hilary Mantel. Following [Wolf Hall](https://openlibrary.org/works/OL464512W) (2009) and [Bring Up the Bodies](https://openlibrary.org/works/OL16547664W) (2012), it is the final instalment in her trilogy charting the rise and fall of Thomas Cromwell, minister in the court of King Henry VIII, covering the last four years of his life, from 1536 until his death by execution in 1540.\r\n\r\nMantel's twelfth novel, her first in almost eight years, The Mirror & The Light was published in March 2020 to widespread critical acclaim, and enjoyed brisk sales. In December 2020, Emily Temple of Literary Hub reported that the novel had made 13 lists of the best books of 2020. It won 2021 Walter Scott Prize for historical fiction."
    },
    {
      "title": "The Complete Unreliable Memoirs",
      "author": "Clive James",
      "openlibrary_key": "OL2738868W",
      "date_read": "2019-12-15",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction"
      ],
      "first_publish_date": "1980",
      "description": ""
    },
    {
      "title": "Atlas Shrugged",
      "author": "Ayn Rand",
      "openlibrary_key": "OL731735W",
      "date_read": "2019-07-15",
      "favourite": false,
      "genres": [
        "Fiction",
        "Philosophy"
      ],
      "description": "Set in a near-future U.S.A. whose economy is collapsing as a result of the mysterious disappearance of leading innovators and industrialists, this novel presents an astounding panorama of human life-from the productive genius who becomes a worthless playboy...to the great steel industrialist who does not know that he is working for his own destruction...to the philosopher who becomes a pirate...to the woman who runs a transcontinental railroad...to the lowest track worker in her train tunnels.\r\n\r\nPeopled by larger-than-life heroes and villains, charged with towering questions of good and evil, Atlas Shrugged is a philosophical revolution told in the form of an action thriller."
    },
    {
      "title": "Record Play Pause",
      "author": "Stephen Morris",
      "openlibrary_key": "OL21143207W",
      "date_read": "2019-05-26",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "As Time Goes By",
      "author": "Derek Taylor",
      "openlibrary_key": "OL19740867W",
      "date_read": "2019-04-16",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "Derek Taylor's iconic memoir is a rare opportunity to be immersed in one of the most whirlwind music sensations in history: Beatlemania. As Time Goes By tells the remarkable story of Taylor's trajectory from humble provincial journalist to loved confidant right at the centre of the Beatles' magic circle. In charming, conversational prose, Taylor shares anecdotes and reminiscences so vivid and immediate that you find yourself plunged into the beating heart of 1960s counterculture. Whether watching the debut performance of 'Hey Jude' in a country pub or hearing first-hand gossip about a star-studded cast of characters, Taylor's unique narrative voice forges an autobiography like no other. Reissued here in a brand new edition with a foreword by celebrated writer Jon Savage, this long-admired memoir is a cult classic of the genre awaiting a new readership."
    },
    {
      "title": "Thanks a lot Mr Kibblewhite",
      "author": "Roger Daltrey",
      "openlibrary_key": "OL28593769W",
      "date_read": "2019-03-27",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Closed Circle",
      "author": "Jonathan Coe",
      "openlibrary_key": "OL2712953W",
      "date_read": "2019-03-11",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "2004",
      "description": "Set against the backdrop of the Millenium celebrations and Britain's increasingly compromised role in America's 'war against terrorism', The Closed Circle lifts the lid on an era in which politics and presentation, ideology and the media have become virtually indistinguishable. Darkly comic, hugely engaging, and compulsively readable, it is the much-anticipated follow-up to Jonathan Coe's bestselling novel The Rotters' Club, and reintroduces us to the characters first encountered in that book. But whereas The Rotters' Club was a novel of innocence, The Closed Circle is its opposite: a novel of experience."
    },
    {
      "title": "The Rotters' Club",
      "author": "Jonathan Coe",
      "openlibrary_key": "OL2712956W",
      "date_read": "2019-02-19",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "2001",
      "description": "Jonathan Coe's widely acclaimed novel is set in the 1970s against a distant backdrop of strikes, terrorist attacks and growing racial tension. A group of young friends inherit the editorship of their school magazine and begin to put their own distinctive spin onto events in the wider world. A zestful comedy of personal and social upheaval, The Rotters' Club captures a fateful moment in British politics - the collapse of 'Old Labour' - and imagines its impact on the topsy-turvy world of the bemused teenager: a world in which a lost pair of swimming trunks can be just as devastating as an IRA bomb."
    },
    {
      "title": "The Hard Stuff",
      "author": "Wayne Kramer",
      "openlibrary_key": "OL19761386W",
      "date_read": "2019-01-20",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "In January 1969, before the world heard a note of their music, The MC5 was on the cover of Rolling Stone. The missing link between free jazz and punk rock, they were raw, primal, and, when things were clicking, absolutely unstoppable. Led by legendary guitarist Wayne Kramer, The MC5 was a reflection of the times: exciting, sexy, violent, chaotic, and out of control, all but assuring their time in the spotlight would be short-lived. They toured the country, played with music legends, and had a rabid following, their music acting as the soundtrack to the blue collar youth movement springing up across the nation. Kramer wanted to redefine what a rock 'n' roll group was capable of, and there was power in reaching for that, but it was also a recipe for disaster, both personally and professionally. The band recorded three major label albums but, by 1972, it was all over. Kramer's story is (literally) a revolutionary one, but it's also the deeply personal struggle of an addict and an artist, a rebel with a great tale to tell. The '60s were not all peace and love, but Kramer shows that peace and love can be born out of turbulence and unrest. From the glory days of Detroit to the junk-sick streets of the East Village, from Key West to Nashville and sunny L.A., in and out of prison and on and off of drugs, his is the classic journeyman narrative, but with a twist: he's here to remind us that revolution is always an option."
    },
    {
      "title": "Trainspotting",
      "author": "Irvine Welsh",
      "openlibrary_key": "OL816259W",
      "date_read": "2019-01-03",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Scottish writer Irvine Welsh's first novel, Trainspotting, is a collection of short-stories revolving around a group of friends, their drug use, and struggles in the city of Edinburgh."
    },
    {
      "title": "Lonely Planet California",
      "author": "Andrea Schulte-Peevers",
      "openlibrary_key": "OL19733702W",
      "date_read": "2018-12-28",
      "favourite": false,
      "genres": [
        "Travel"
      ],
      "description": "Presents a guide to California, describing accommodation, restaurants, transportation, shopping, major points of interest, and sightseeing activities."
    },
    {
      "title": "Mr Nice",
      "author": "Howard Marks",
      "openlibrary_key": "OL4322915W",
      "date_read": "2018-12-05",
      "favourite": false,
      "genres": [
        "Crime",
        "Memoir"
      ],
      "description": "THE BOOK: During the mid 1980's Howard Marks had forty three aliases, eighty nine phone lines and owned twenty five companies throughout the world. Whether bars, recording studios or offshore banks, all were money laundering vehicles serving the core activity: dope dealingMarks began to deal small amounts of hashish while doing a postgraduate philosopy course at Oxford and soon he was moving much larger quantities into Europe and into America the equipment of touring British rock bands. The academic life began to lose its allure. At the height of his career he was smuggling consignments of up to fifty tons from Pakistan and Thailand to America and Canada and had contact with organisations as diverse as MI6, the CIA, the IRA and the Mafia. Numerous newspaper profiles, books and television documentaries have been devoted to Howard Mark's life. Touched with humour charm and candour, Mr Nice is his own extraordinary story."
    },
    {
      "title": "The Secret History",
      "author": "Donna Tartt",
      "openlibrary_key": "OL4321141W",
      "date_read": "2018-11-08",
      "favourite": true,
      "genres": [
        "Fiction"
      ],
      "description": "Under the influence of their charismatic classics professor, a group of clever, eccentric misfits at an elite New England college discover a way of thinking and living that is a world away from the humdrum existence of their contemporaries. But when they go beyond the boundaries of normal morality they slip gradually from obsession to corruption and betrayal, and at last - inexorably - into evil."
    },
    {
      "title": "Bring It On Home",
      "author": "Mark Blake",
      "openlibrary_key": "OL22161110W",
      "date_read": "2018-10-25",
      "favourite": false,
      "genres": [
        "Biography",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "White Line Fever",
      "author": "Lemmy Kilmister",
      "openlibrary_key": "OL27352567W",
      "date_read": "2018-09-26",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Fallen",
      "author": "Dave Simpson",
      "openlibrary_key": "OL15185845W",
      "date_read": "2018-09-05",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "Ever been held hostage in a dressing room with your parents? Ever been thrown off the bus in the middle of a Swedish forest or abandoned at a foreign airport? Ever been asked to play at one of the UK's biggest music festivals with musicians you've just met who are covered in blood, or taken part in a 'recording session' in a speeding Transit? If so you've probably been in The Fall. Dave Simpson made it his mission to track down everyone who has ever played in Britain's most berserk, brilliant group. He uncovers a changing Britain, tales of madness and genius, and wreaks havoc on his personal life."
    },
    {
      "title": "Chapter and Verse",
      "author": "Bernard Sumner",
      "openlibrary_key": "OL21095875W",
      "date_read": "2018-07-07",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music"
      ],
      "description": ""
    },
    {
      "title": "Can't Stand Up For Falling Down",
      "author": "Allan Jones",
      "openlibrary_key": "OL21143858W",
      "date_read": "2018-06-19",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "viii, 337 pages, 8 unnumbered pages of plates : 24 cm"
    },
    {
      "title": "Beastie Boys Book",
      "author": "Michael Diamond",
      "openlibrary_key": "OL21187892W",
      "date_read": "2018-06-18",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Alan McGee and The Story of Creation Records",
      "author": "Paolo Hewitt",
      "openlibrary_key": "OL2081569W",
      "date_read": "2018-06-08",
      "favourite": false,
      "genres": [
        "Biography",
        "Music",
        "Non-Fiction"
      ],
      "first_publish_date": "2000",
      "description": ""
    },
    {
      "title": "Uncommon People",
      "author": "David Hepworth",
      "openlibrary_key": "OL21139342W",
      "date_read": "2018-06-01",
      "favourite": false,
      "genres": [
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Up and Down with The Rolling Stones",
      "author": "Tony Sanchez",
      "openlibrary_key": "OL15960417W",
      "date_read": "2018-05-18",
      "favourite": false,
      "genres": [
        "Biography",
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "Tony Sanchez worked for Keith Richards for eight years buying drugs, running errands and orchestrating cheap thrills. He records unforgettable accounts of the Stones' perilous misadventures racing cars along the Cote d'Azur; murder at Altamont; nights with the Beatles at the Stones-owned nightclub Vesuvio, and more."
    },
    {
      "title": "The True Adventures of the Rolling Stones",
      "author": "Stanley Booth",
      "openlibrary_key": "OL5750665W",
      "date_read": "2018-05-14",
      "favourite": false,
      "genres": [
        "Biography",
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "At Last",
      "author": "Edward St Aubyn",
      "openlibrary_key": "OL16152188W",
      "date_read": "2018-04-26",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Friends, relatives, and foes trickle in to pay final respects to Patrick's mother, Eleanor. An American heiress, Eleanor married into the British aristocracy, giving up the grandeur of her upbringing for \"good works\" freely bestowed on everyone but her own son, who finds himself questioning whether his transition to a life without parents will indeed be the liberation he had so long imagined."
    },
    {
      "title": "Mother's Milk",
      "author": "Edward St Aubyn",
      "openlibrary_key": "OL25660537W",
      "date_read": "2018-04-26",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Never Mind",
      "author": "Edward St Aubyn",
      "openlibrary_key": "OL25671442W",
      "date_read": "2018-04-26",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Some Hope",
      "author": "Edward St Aubyn",
      "openlibrary_key": "OL25665873W",
      "date_read": "2018-04-26",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Bad News",
      "author": "Edward St Aubyn",
      "openlibrary_key": "OL25672138W",
      "date_read": "2018-04-26",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Set the Boy Free",
      "author": "Johnny Marr",
      "openlibrary_key": "OL20043011W",
      "date_read": "2018-03-28",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Cured",
      "author": "Lol Tolhurst",
      "openlibrary_key": "OL20215026W",
      "date_read": "2018-03-24",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Born to Run",
      "author": "Bruce Springsteen",
      "openlibrary_key": "OL18146678W",
      "date_read": "2018-02-03",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music"
      ],
      "description": ""
    },
    {
      "title": "David Bowie",
      "author": "Dylan Jones",
      "openlibrary_key": "OL19720096W",
      "date_read": "2018-01-03",
      "favourite": true,
      "genres": [
        "Biography",
        "Music",
        "Non-Fiction"
      ],
      "description": "Tracing Bowie's life from the English suburbs to London to New York to Los Angeles, Berlin, and beyond, Jones describes a man profoundly shaped by his relationship with his schizophrenic half-brother Terry; an intuitive artist who could absorb influences through intense relationships and yet drop people cold when they were no longer of use; and a social creature equally comfortable partying with John Lennon and dining with Frank Sinatra. By turns insightful and deliciously gossipy, it will transform our understanding of both artist and art."
    },
    {
      "title": "Knots And Crosses",
      "author": "Ian Rankin",
      "openlibrary_key": "OL483838W",
      "date_read": "2017-11-30",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "description": "Edinburgh policeman, John Rebus, must solve murders involving seeming crank letters. He is not the only officer workering the case, but the only one who has all the pieces to resolve it."
    },
    {
      "title": "The Troubled Man",
      "author": "Henning Mankell",
      "openlibrary_key": "OL15679291W",
      "date_read": "2017-08-19",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "description": "Con El hombre inquieto, Mankell retoma las andanzas del inspector Wallander, del que supimos por última vez en el volumen Antes de que hiele, y, según asegura el autor sueco, tal vez nos hallemos ante la última aventura protagonizada por el entrañable inspector.\r\nLa vida del inspector Kurt Wallander ha cambiado ligeramente: no sólo ha hecho realidad su sueño de tener una casa en el campo, sino que, además, su hija Linda lo ha convertido en abuelo. Sin embargo, su tranquilidad se ve perturbada poco después, un día de invierno de 2008, cuando el suegro de Linda, un oficial de alto rango de la Marina sueca llamado Håkan von Enke, desaparece en un bosque cerca de Estocolmo. Aunque la investigación la dirige la policía de Estocolmo, Wallander no puede evitar implicarse, sobre todo cuando una segunda persona desaparece en misteriosas circunstancias. Algunas pistas apuntan a grupos de extrema derecha en el seno de la Marina sueca y a la época de la Guerra Fría, en particular a la década de los ochenta, cuando varios submarinos soviéticos fueron acusados de violar territorio sueco. Wallander comprende que está a punto de desvelar un gran secreto cuyo alcance abarcaría toda la historia de Suecia tras la segunda guerra mundial. Pero una nube aún más negra asoma por el horizonte."
    },
    {
      "title": "The Pyramid",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158687W",
      "date_read": "2017-07-18",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "1999",
      "description": "The essential read for all fans of Kurt Wallander.When Kurt Wallander first appeared in Faceless Killers back in 1990, he was a senior police officer, just turned forty, with his life in a mess. His wife had left him, his father barely acknowledged him; he ate badly and drank alone at night. The Pyramid chronicles the events that led him to such a place. We see him in the early years, doing hours on the beat whilst trying to solve a murder off-duty; witness the beginnings of his fragile relationship with Mona, the woman he has his heart set on marrying; and learn the reason behind his difficulties with his father. These thrilling tales provide a fascinating insight into Wallander's character, and demand to be read in one sitting. From the stabbing of a neighbour in 1969 to a light aircraft accident in 1989, every story is a vital piece of the Wallander series, showing Mankell at the top of his game. Featuring an introduction from the author, The Pyramid is an essential read for all fans of Kurt Wallander."
    },
    {
      "title": "Firewall",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158670W",
      "date_read": "2017-06-23",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "2002",
      "description": "Stopping to get money from a cash machine one evening, a man inexplicably falls to the ground: dead. A taxi driver is brutally murdered by two teenaged girls. Quickly apprehended they appal local policemen with their total lack of remorse.Stopping to get money from a cash machine one evening, a man inexplicably falls to the ground: dead. A taxi driver is brutally murdered by two teenaged girls. Quickly apprehended they appal local policemen with their total lack of remorse. One girl escapes police custody and disappears without trace. Soon afterwards a blackout covers half the country. When an engineer arrives at the malfunctioning power station, he makes a grisly discovery. Inspector Kurt Wallander is sure that these events must be linked - somehow. Hampered by the discovery of betrayals in his own team, lonely and frustrated, Wallander begins to lose conviction in his role as a detective. The search for answers leads Wallander dangerously close to a shadowy group of anarchic terrorists, hidden within the anonymity of cyberspace. Somehow these criminals seem always to know the police's next move. Wallander finds himself fighting to outsmart them In their gripping police procedural about our increasing vulnerability in the modern digitalised world."
    },
    {
      "title": "One Step Behind",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158685W",
      "date_read": "2017-06-20",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "February 2002",
      "description": "It is Midsummer's Eve. Three young friends meet in a wood to act out an elaborate masque. But, unknown to them, they are being watched. Each is killed by a single bullet.It is Midsummer's Eve. Three young friends meet in a wood to act out an elaborate masque. But, unknown to them, they are being watched. Each is killed by a single bullet. Soon afterwards, one of Inspector Wallander's colleagues is found murdered. Is it the same killer, and what could the connection be? In this investigation Wallander is always, tantalisingly, one step behind."
    },
    {
      "title": "The Fifth Woman",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158657W",
      "date_read": "2017-01-04",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "September 5, 2002",
      "description": "In an African convent, four nuns and a unidentified fifth woman are brutally murdered--the death of the unknown woman covered up by the local police. A year later in Sweden, Inspector Kurt Wallander is baffled and appalled by two murders. Holger Eriksson, a retired car dealer and bird watcher, is impaled on sharpened bamboo poles in a ditch behind his secluded home, and the body of a missing florist is discovered--strangled and tied to a tree. The only clues Wallander has to go on are a skull, a diary, and a photo of three men. What ensues is a case that will test Wallander’s strength and patience, because in order to discover the reason behind these murders, he will also need to uncover the elusive connection between these deaths and the earlier unsolved murder in Africa of the fifth woman. \r\n\r\nfrom Goodreads"
    },
    {
      "title": "Grumpy Old Rock Star",
      "author": "Rick Wakeman",
      "openlibrary_key": "OL17403359W",
      "date_read": "2016-12-08",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Sidetracked",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158689W",
      "date_read": "2016-11-30",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "1999",
      "description": "WALLANDER' NOW A MAJOR TELEVISION DRAMA SERIAL ON BBC1Midsummer approaches, and Wallander prepares for a holiday with the new woman in his life, hopeful that his wayward daughter and his ageing father will cope without him. But his summer is ruined when a girl commits suicide before his eyes, and a former minister of justice is butchered in the first of a series of apparently motiveless murders. Wallander's hunt for the girl's identity and his furious pursuit of a killer who scalps his victims will throw him and those he loves most into mortal danger."
    },
    {
      "title": "The Man Who Smiled",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158693W",
      "date_read": "2016-11-04",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "September 1, 2005",
      "description": "La quatrième de couverture indique : \"Le brouillard est épais en cette nuit automnale. Le vieil avocat Gustaf Torstensson est au volant. Soudain, une étrange silhouette surgit au milieu de la route : c'est un mannequin de taille humaine, assis sur une chaise. Torstensson freine brutalement, sort de sa voiture. On ne le reverra jamais vivant. Son fils fait appel au commissaire Wallander. Celui-ci va découvrir un réseau criminel derrière lequel se profile un homme singulier, élégant et sûr de lui. Un homme qui sourit toujours.\""
    },
    {
      "title": "User Story Mapping",
      "author": "Jeff Patton",
      "openlibrary_key": "OL17893428W",
      "date_read": "2016-10-07",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Thinking, Fast and Slow",
      "author": "Daniel Kahneman",
      "openlibrary_key": "OL15992072W",
      "date_read": "2016-10-07",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Psychology",
        "Self-Help"
      ],
      "description": "In his mega bestseller, Thinking, Fast and Slow, Daniel Kahneman, world-famous psychologist and winner of the Nobel Prize in Economics, takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think.\r\n\r\nSystem 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. The impact of overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the profound effect of cognitive biases on everything from playing the stock market to planning our next vacation―each of these can be understood only by knowing how the two systems shape our judgments and decisions.\r\n\r\nEngaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives―and how we can use different techniques to guard against the mental glitches that often get us into trouble. Topping bestseller lists for almost ten years, Thinking, Fast and Slow is a contemporary classic, an essential book that has changed the lives of millions of readers."
    },
    {
      "title": "Good To Great",
      "author": "Jim Collins",
      "openlibrary_key": "OL6669337W",
      "date_read": "2016-10-06",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction"
      ],
      "description": "The Challenge:\r\nBuilt to Last, the defining management study of the nineties, showed how great companies triumph over time and how long-term sustained performance can be engineered into the DNA of an enterprise from the verybeginning.\r\n\r\nBut what about the company that is not born with great DNA? How can good companies, mediocre companies, even bad companies achieve enduring greatness?\r\n\r\nThe Study: \r\nFor years, this question preyed on the mind of Jim Collins. Are there companies that defy gravity and convert long-term mediocrity or worse into long-term superiority? And if so, what are the universal distinguishing characteristics that cause a company to go from good to great?\r\n\r\nThe Standards:\r\nUsing tough benchmarks, Collins and his research team identified a set of elite companies that made the leap to great results and sustained those results for at least fifteen years. How great? After the leap, the good-to-great companies generated cumulative stock returns that beat the general stock market by an average of seven times in fifteen years, better than twice the results delivered by a composite index of the world's greatest companies, including Coca-Cola, Intel, General Electric, and Merck.\r\n\r\nThe Comparisons: \r\nThe research team contrasted the good-to-great companies with a carefully selected set of comparison companies that failed to make the leap from good to great. What was different? Why did one set of companies become truly great performers while the other set remained only good?\r\n\r\nOver five years, the team analyzed the histories of all twenty-eight companies in the study. After sifting through mountains of data and thousands of pages of interviews, Collins and his crew discovered the key determinants of greatness -- why some companies make the leap and others don't.\r\n\r\nThe Findings:\r\nThe findings of the Good to Great study will surprise many readers and shed light on virtually every area of management strategy and practice. The findings include:\r\n\r\nLevel 5 Leaders: The research team was shocked to discover the type of leadership required to achieve greatness.\r\nThe Hedgehog Concept: (Simplicity within the Three Circles): To go from good to great requires transcending the curse of competence.\r\nA Culture of Discipline: When you combine a culture of discipline with an ethic of entrepreneurship, you get the magical alchemy of great results. Technology Accelerators: Good-to-great companies think differently about the role of technology.\r\nThe Flywheel and the Doom Loop: Those who launch radical change programs and wrenching restructurings will almost certainly fail to make the leap.\r\n“Some of the key concepts discerned in the study,” comments Jim Collins, \"fly in the face of our modern business culture and will, quite frankly, upset some people.”\r\n\r\nPerhaps, but who can afford to ignore these findings?"
    },
    {
      "title": "The White Lioness",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158630W",
      "date_read": "2016-09-20",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "1997",
      "description": "Una tarde de primavera de 1992, la joven agente inmobiliaria Louise Akerblom es brutalmente asesinada en una solitaria y apartada granja de Escania. Un caso difícil para la polícia, pues, a primera vista, no hay un móvil claro, y todo parece indicar que la muchacha sólo vio algo que no debía ver.\r\n\r\nEsta investigación supone para Wallander un descenso a los infiernos mucho más largo y profundo de lo que nunca hubiera imaginado al iniciarse un caso. Y esta vez, además, se trata de una conspiración internacional detrás de la cual se encuentra una organización de extrema derecha. Ésta, decidida a dinamitar el proceso antiapartheid en la lejana Sudáfrica, ha contratado a un asesino a sueldo, quien, con la ayuda de un antiguo agente de la KGB, planea atentar contra un importante dirigente muy cerca de donde Wallander investiga. Acosado por sus persistentes problemas personales, el inspector entrará en una espiral de suspense cada vez más"
    },
    {
      "title": "The Dogs of Riga",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158639W",
      "date_read": "2016-09-02",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "January 1, 2000",
      "description": "Una fría mañana de febrero llega un bote salvavidas a la costa sueca arrastrado por la corriente. Dentro encuentran los cadáveres de dos hombres que, como confirma el inspector Wallander, han sido asesinados hace días. Aquejado de estrés y de intensos dolores de pecho, con remordimientos por su anciano padre y sin haber encajado bien la separación de su mujer, Kurt Wallander, una vez abierta la investigación, debe hacer de tripas corazón y posponer sus buenos propósitos de cuidarse más. Al averiguarse que los dos hombres asesinados eran letones, Wallander no tiene más remedio que viajar a Riga, donde se introduce en los ambientes más corruptos, gobernados por bandas criminales."
    },
    {
      "title": "Faceless Killers",
      "author": "Henning Mankell",
      "openlibrary_key": "OL158674W",
      "date_read": "2016-08-29",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction",
        "Mystery"
      ],
      "first_publish_date": "April 20, 2000",
      "description": "En natt i januari mördas Maria och Johannes Lövgren, ett äldre bondepar i Skåne. Innan kvinnan avlider yttrar hon ordet ”utländsk”. Någon tid senare brinner stadens flyktingförläggning och en somalisk flykting blir mördad. Den som hotar menar uppenbarligen allvar. Kommissarie Wallander tar upp kampen mot den hänsynslöse mördaren."
    },
    {
      "title": "The Hacienda: How Not to Run a Club",
      "author": "Peter Hook",
      "openlibrary_key": "OL17469151W",
      "date_read": "2016-08-18",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Sprint",
      "author": "Jake Knapp",
      "openlibrary_key": "OL17353358W",
      "date_read": "2016-07-26",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": "From three partners at Google Ventures, a unique five-day process for solving tough problems, proven at more than a hundred companies.\r\n\r\nEntrepreneurs and leaders face big questions every day: What’s the most important place to focus your effort, and how do you start? What will your idea look like in real life? How many meetings and discussions does it take before you can be sure you have the right solution?\r\n\r\nNow there’s a surefire way to answer these important questions: the sprint. Designer Jake Knapp created the five-day process at Google, where sprints were used on everything from Google Search to Google X. He joined Braden Kowitz and John Zeratsky at Google Ventures, and together they have completed more than a hundred sprints with companies in mobile, e-commerce, healthcare, finance, and more.\r\n\r\nA practical guide to answering critical business questions, Sprint is a book for teams of any size, from small startups to Fortune 100s, from teachers to nonprofits. It’s for anyone with a big opportunity, problem, or idea who needs to get answers today."
    },
    {
      "title": "Gomorrah",
      "author": "Roberto Saviano",
      "openlibrary_key": "OL31471495W",
      "date_read": "2016-07-06",
      "favourite": false,
      "genres": [
        "Crime",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Life",
      "author": "Keith Richards",
      "openlibrary_key": "OL15426455W",
      "date_read": "2016-06-24",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "Autobiography of the guitarist, songwriter, singer, and founding member of the Rolling Stones, Keith Richards. With the Rolling Stones, Keith Richards lived the original rock and roll life. He tells his story of life in the crossfire hurricane; his listening obsessively to Chuck Berry and Muddy Waters records, learning guitar and forming a band with Mick Jagger and Brian Jones, the Rolling Stones' first fame and the notorious drug busts that led to his enduring image as outlaw folk hero, creating immortal riffs like the ones in \"Jumping Jack Flash\" and \"Honky Tonk Women.\" He discusses falling in love with Anita Pallenberg and the death of Brian Jones, his tax exile in France, wildfire tours of the U.S., isolation and addiction, as well as falling in love with Patti Hansen, and his bitter estrangement from Jagger and subsequent reconciliation. He talks about his marriage, family, solo albums and Xpensive Winos; the road that goes on forever."
    },
    {
      "title": "Porcelain",
      "author": "Moby",
      "openlibrary_key": "OL20028134W",
      "date_read": "2016-06-09",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "From Moby, one of the most interesting and iconic musicians of our time, comes a piercingly tender, funny, and harrowing account of the path from suburban poverty and alienation to a life of beauty, squalor, and unlikely success."
    },
    {
      "title": "Call for the Dead",
      "author": "John le Carré",
      "openlibrary_key": "OL29776W",
      "date_read": "2016-05-15",
      "favourite": false,
      "genres": [
        "Fiction",
        "Thriller"
      ],
      "first_publish_date": "1961",
      "description": "Le Carre's first book which introduces George Smiley. Smiley investigates the apparent suicide of Samuel Fennan, who worked in the Foreign Office and had been under investigation due to his communist background at Oxford."
    },
    {
      "title": "Kill Your Friends",
      "author": "John Niven",
      "openlibrary_key": "OL21077045W",
      "date_read": "2016-04-09",
      "favourite": false,
      "genres": [
        "Fiction",
        "Music"
      ],
      "description": ""
    },
    {
      "title": "Bring Up the Bodies",
      "author": "Hilary Mantel",
      "openlibrary_key": "OL16547664W",
      "date_read": "2016-02-25",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "Bring Up the Bodies is a historical novel by Hilary Mantel; sequel to the award-winning [Wolf Hall;](https://openlibrary.org/works/OL464512W) and part of a trilogy charting the rise and fall of Thomas Cromwell, the powerful minister in the court of King Henry VIII. It won the 2012 Man Booker Prize and the 2012 Costa Book of the Year. The final novel in the trilogy, [The Mirror and the Light](https://openlibrary.org/works/OL20665410W), was published in March 2020."
    },
    {
      "title": "Wolf Hall",
      "author": "Hilary Mantel",
      "openlibrary_key": "OL464512W",
      "date_read": "2016-01-01",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "Wolf Hall (2009) is a historical novel by English author Hilary Mantel, published by Fourth Estate, named after the Seymour family's seat of Wolfhall, or Wulfhall, in Wiltshire. Set in the period from 1500 to 1535, Wolf Hall is a sympathetic fictionalised biography documenting the rapid rise to power of Thomas Cromwell in the court of Henry VIII through to the death of Sir Thomas More. The novel won both the Man Booker Prize and the National Book Critics Circle Award. In 2012, The Observer named it as one of \"The 10 best historical novels\".\r\n\r\nThe book is the first in a trilogy; the sequel [Bring Up the Bodies](https://openlibrary.org/works/OL16547664W) was published in 2012. The last book in the trilogy is [The Mirror and the Light](https://openlibrary.org/works/OL20665410W) (2020), which covers the last four years of Cromwell's life."
    },
    {
      "title": "When the Doves Disappeared",
      "author": "Sofi Oksanen",
      "openlibrary_key": "OL19090077W",
      "date_read": "2015-12-09",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "\"From the internationally acclaimed author of Purge--a chillingly suspenseful, deftly woven new novel that opens up a little-known yet still controversial chapter of history: the occupation, resistance, and collaboration in Estonia during and after World War II. 1941: In Communist-ruled, war-ravaged Estonia, two men have deserted the Red Army--Roland, a fiercely principled freedom fighter, and his slippery cousin Edgar. When the Germans arrive, Roland goes into hiding; Edgar abandons his unhappy wife, Juudit, and takes on a new identity as a loyal supporter of the Nazi regime... 1963: Estonia is again under Communist control, independence even further out of reach behind the Iron Curtain. Edgar is now a Soviet apparatchik, desperate to hide the secrets of his past life and stay close to those in power. But his fate remains entangled with Roland's, and with Juudit, who may hold the key to uncovering the truth... In a masterfully told story that moves between the tumult of these two brutally repressive eras--a story of surveillance, deception, passion, and betrayal--Sofi Oksanen brings to life both the frailty, and the resilience, of humanity under the shadow of tyranny\"--\n\n\"1941: In Communist-ruled, war-ravaged Estonia, two men have deserted the Red Army--Roland, a fiercely principled freedom fighter, and his slippery cousin Edgar. When the Germans arrive, Roland goes into hiding; Edgar abandons his unhappy wife, Juudit, and takes on a new identity as a loyal supporter of the Nazi regime... 1963: Estonia is again under Communist control, independence even further out of reach behind the Iron Curtain. Edgar is now a Soviet apparatchik, desperate to hide the secrets of his past life and stay close to those in power. But his fate remains entangled with Roland's, and with Juudit, who may hold the key to uncovering the truth... In a masterfully told story that moves between the tumult of these two brutally repressive eras--a story of surveillance, deception, passion, and betrayal--Sofi Oksanen brings to life both the frailty, and the resilience, of humanity under the shadow of tyranny\"--"
    },
    {
      "title": "A Little Life",
      "author": "Hanya Yanagihara",
      "openlibrary_key": "OL17370186W",
      "date_read": "2015-12-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "A Little Life is a 2015 novel by American novelist Hanya Yanagihara. The novel was written over the course of eighteen months. Despite the length and difficult subject matter, it became a bestseller."
    },
    {
      "title": "Acts of the Assassins",
      "author": "Richard Beard",
      "openlibrary_key": "OL20828723W",
      "date_read": "2015-12-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "A Brief History of Seven Killings",
      "author": "Marlon James",
      "openlibrary_key": "OL17187702W",
      "date_read": "2015-12-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "\"From the acclaimed writer of The Book of Night Women comes a masterful novel framed as a fictional oral history that explores the events and characters surrounding the attempted assassination of Bob Marley during the political turmoil on Jamaica in the late 1970s\"--"
    },
    {
      "title": "HHhH",
      "author": "Laurent Binet",
      "openlibrary_key": "OL19981300W",
      "date_read": "2015-12-09",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": ""
    },
    {
      "title": "How to Win Friends and Influence People",
      "author": "Dale Carnegie",
      "openlibrary_key": "OL1063267W",
      "date_read": "2015-11-03",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Psychology",
        "Self-Help"
      ],
      "description": "Available for the first time ever in trade paperback, Dale Carnegie's enduring classic, the inspirational personal development guide that shows how to achieve lifelong success. One of the top-selling books of all time, \"How to Win Friends & Influence People\" has sold more than 15 million copies in all its editions."
    },
    {
      "title": "Lean UX",
      "author": "Jeff Gothelf",
      "openlibrary_key": "OL20039892W",
      "date_read": "2015-11-02",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Effortless Experience",
      "author": "Matthew Dixon",
      "openlibrary_key": "OL21059440W",
      "date_read": "2015-11-02",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Everyday Super Food",
      "author": "Jamie Oliver",
      "openlibrary_key": "OL31369355W",
      "date_read": "2015-09-28",
      "favourite": false,
      "genres": [
        "Food Writing",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Martian",
      "author": "Andy Weir",
      "openlibrary_key": "OL17091839W",
      "date_read": "2015-09-13",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "The Martian is a 2011 science fiction novel written by Andy Weir. It was his debut novel under his own name. It was originally self-published in 2011; Crown Publishing purchased the rights and re-released it in 2014. The story follows an American astronaut, Mark Watney, as he becomes stranded alone on Mars in 2035 and must improvise in order to survive."
    },
    {
      "title": "Jamie's 30-Minute Meals",
      "author": "Jamie Oliver",
      "openlibrary_key": "OL16524594W",
      "date_read": "2014-03-02",
      "favourite": false,
      "genres": [
        "Food Writing",
        "Non-Fiction"
      ],
      "description": "I'm going to show you how to put a whole meal on the table in 30 minutes flat! Not just one dish, a whole spread of beautiful things."
    },
    {
      "title": "The Luminaries",
      "author": "Eleanor Catton",
      "openlibrary_key": "OL16810597W",
      "date_read": "2013-11-23",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "Winner of the Man Booker Prize of 2013. Wonderful novel taking place in New-Zealand during the golden rush. \r\nUne intrigue complexe et fine à la fois, vrai roman d'aventure historique mais pas seulement. L'auteur s'amuse avec nous et nous mène de révélations en révélations tout en nous laissant à la fin du livre avec une grande envie de continuer dans le monde qu'elle a créé pour nous."
    },
    {
      "title": "The Goldfinch",
      "author": "Donna Tartt",
      "openlibrary_key": "OL16809803W",
      "date_read": "2013-11-23",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "\"The Goldfinch is a rarity that comes along perhaps half a dozen times per decade, a smartly written literary novel that connects with the heart as well as the mind....Donna Tartt has delivered an extraordinary work of fiction.\"--Stephen King, The New York Times Book Review\r\n\r\nComposed with the skills of a master, The Goldfinch is a haunted odyssey through present day America and a drama of enthralling force and acuity.\r\n\r\nIt begins with a boy. Theo Decker, a thirteen-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mother, he clings to one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art. \r\n\r\nAs an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love-and at the center of a narrowing, ever more dangerous circle. \r\n\r\nThe Goldfinch is a novel of shocking narrative energy and power. It combines unforgettably vivid characters, mesmerizing language, and breathtaking suspense, while plumbing with a philosopher's calm the deepest mysteries of love, identity, and art. It is a beautiful, stay-up-all-night and tell-all-your-friends triumph, an old-fashioned story of loss and obsession, survival and self-invention, and the ruthless machinations of fate."
    },
    {
      "title": "Autobiography",
      "author": "Morrissey",
      "openlibrary_key": "OL19704914W",
      "date_read": "2013-11-01",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": "It has been said 'Most pop stars have to be dead before they reach the iconic status that Morrissey has reached in his lifetime'. This title covers his life from birth until the present day."
    },
    {
      "title": "Ottolenghi: The Cookbook",
      "author": "Yotam Ottolenghi",
      "openlibrary_key": "OL19706642W",
      "date_read": "2013-09-09",
      "favourite": false,
      "genres": [
        "Food Writing",
        "Non-Fiction"
      ],
      "description": "\"Available for the first time in an American edition and updated with US measurements throughout, this debut cookbook ... features 140 recipes culled from the popular Ottolenghi restaurants and inspired by the diverse culinary traditions of the Mediterranean.\"--Page 4 of cover."
    },
    {
      "title": "A5/05: Lufthansa and Graphic Design",
      "author": "Jens Muller",
      "openlibrary_key": "OL17428958W",
      "date_read": "2013-03-20",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Own Label: Sainsburys Design Studio",
      "author": "Jonny Trunk",
      "openlibrary_key": "OL21215158W",
      "date_read": "2013-03-20",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Rabbit, Run",
      "author": "John Updike",
      "openlibrary_key": "OL463836W",
      "date_read": "2013-03-17",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Its hero is Harry “Rabbit” Angstrom, a onetime high-school basketball star who on an impulse deserts his wife and son. He is twenty-six years old, a man-child caught in a struggle between instinct and thought, self and society, sexual gratification and family duty—even, in a sense, human hard-heartedness and divine Grace. Though his flight from home traces a zigzag of evasion, he holds to the faith that he is on the right path, an invisible line toward his own salvation as straight as a ruler’s edge"
    },
    {
      "title": "Parade's End",
      "author": "Ford Madox Ford",
      "openlibrary_key": "OL509919W",
      "date_read": "2013-03-17",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Consisting of four novels - SOME DO NOT..., NO MORE PARADES, A MAN COULD STAND UP and THE LAST POST - PARADE'S END is the story of Christopher Tietjens and his progress from the secure world of Edwardian England into the First World War and beyond. Tietjens embodies the values of that ordered, predictable, hierarchic society of pre-1914. Contrasted with him and portrayed with equal clarity and depth is his wife Sylvia—beautiful, arrogant, reckless—a symbol of the new times. Their conflict, the chronicle of a family and of an era, makes PARADE'S END both a gripping study of character and a work of amazing subtlety and depth."
    },
    {
      "title": "The Handmaid's Tale",
      "author": "Margaret Atwood",
      "openlibrary_key": "OL675783W",
      "date_read": "2013-03-17",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "The Handmaid's Tale is a dystopian novel by Canadian author Margaret Atwood, published in 1985. It is set in a near-future New England, in a strongly patriarchal, totalitarian theonomic state, known as the Republic of Gilead, which has overthrown the United States government. The central character and narrator is a woman named Offred, one of the group known as \"handmaids\", who are forcibly assigned to produce children for the \"commanders\" — the ruling class of men in Gilead.\r\n\r\nThe novel explores themes of subjugated women in a patriarchal society, loss of female agency and individuality, and the various means by which they resist and attempt to gain individuality and independence.\r\n\r\nThe Handmaid's Tale won the 1985 Governor General's Award and the first Arthur C. Clarke Award in 1987; it was also nominated for the 1986 Nebula Award, the 1986 Booker Prize, and the 1987 Prometheus Award.\r\n\r\n\r\n----------\r\nAlso contained in:\r\n[Novels](https://openlibrary.org/works/OL24301311W)"
    },
    {
      "title": "True History of the Kelly Gang",
      "author": "Peter Carey",
      "openlibrary_key": "OL34785545W",
      "date_read": "2012-05-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "\"I lost my own father at 12 yr. of age and know what it is to be raised on lies and silences my dear daughter you are presently too young to understand a word I write but this history is for you and will contain no single lie may I burn in Hell if I speak false.\"\r\nIn True History of the Kelly Gang, the legendary Ned Kelly speaks for himself, scribbling his narrative on errant scraps of paper in semiliterate but magically descriptive prose as he flees from the police. To his pursuers, Kelly is nothing but a monstrous criminal, a thief and a murderer. To his own people, the lowly class of ordinary Australians, the bushranger is a hero, defying the authority of the English to direct their lives. Indentured by his bootlegger mother to a famous horse thief (who was also her lover), Ned saw his first prison cell at 15 and by the age of 26 had become the most wanted man in the wild colony of Victoria, taking over whole towns and defying the law until he was finally captured and hanged. Here is a classic outlaw tale, made alive by the skill of a great novelist."
    },
    {
      "title": "The Blind Assassin",
      "author": "Margaret Atwood",
      "openlibrary_key": "OL675698W",
      "date_read": "2012-05-09",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "More than fifty years on, Iris Chase is remembering Laura's mysterious death. And so begins an extraordinary and compelling story of two sisters and their secrets. Set against a panoramic backdrop of twentieth-century history, The Blind Assassin is an epic tale of memory, intrigue and betrayal..."
    },
    {
      "title": "The Martian Chronicles",
      "author": "Ray Bradbury",
      "openlibrary_key": "OL103134W",
      "date_read": "2012-05-09",
      "favourite": false,
      "genres": [
        "Science Fiction"
      ],
      "description": "This is a collection of science fiction short stories, cleverly cobbled together to form a coherent and very readable novel about a future colonization of Mars. As the stories progress chronologically the author tells how the first humans colonized Mars, initially sharing the planet with a handful of Martians. When Earth is devastated by nuclear war the colony is left to fend for itself and the colonists determine to build a new Earth on Mars."
    },
    {
      "title": "Never Let Me Go",
      "author": "Kazuo Ishiguro",
      "openlibrary_key": "OL59038W",
      "date_read": "2012-05-09",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Ishiguro explores what it means to have a soul and how art distinguishes man from other life forms. But above all, *Never Let Me Go* is a study of friendship and the bonds we form which make or break while we come of age."
    },
    {
      "title": "Steppenwolf",
      "author": "Hermann Hesse",
      "openlibrary_key": "OL872773W",
      "date_read": "2012-05-09",
      "favourite": false,
      "genres": [
        "Fiction",
        "Philosophy"
      ],
      "description": "A story that focuses on the loneliness and suffering of the protagonist, Harry Haller, who feels that he has no place in a world filled with meaningless frivolity. Having decided to take his own life a chance encounter causes him to change his views and he begins to learn ways to enjoy life. One of the most misunderstood of his novels the book is, according to Hesse, about the possibilities of transcendence and healing."
    },
    {
      "title": "Mindfulness",
      "author": "Mark Williams",
      "openlibrary_key": "OL19643667W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Self-Help"
      ],
      "description": ""
    },
    {
      "title": "The Kitchen Diaries",
      "author": "Nigel Slater",
      "openlibrary_key": "OL6671426W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Food Writing",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "openlibrary_key": "OL468431W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Here is a novel, glamorous, ironical, compassionate – a marvelous fusion into unity of the curious incongruities of the life of the period – which reveals a hero like no other – one who could live at no other time and in no other place. But he will live as a character, we surmise, as long as the memory of any reader lasts.\r\n\r\n\"There was something gorgeous about him, some heightened sensitivity to the promises of life.... It was an extraordinary gift for hope, a romantic readiness such as I have never found in any other person and which it is not likely I shall ever find again.\"\r\n\r\nIt is the story of this Jay Gatsby who came so mysteriously to West Egg, of his sumptuous entertainments, and of his love for Daisy Buchanan – a story that ranges from pure lyrical beauty to sheer brutal realism, and is infused with a sense of the strangeness of human circumstance in a heedless universe.\r\n\r\nIt is a magical, living book, blended of irony, romance, and mysticism.\r\n\r\n--first edition jacket\r\n\r\n\r\n----------\r\nAlso contained in:\r\n\r\n - [The Fitzgerald Reader](https://openlibrary.org/works/OL468551W/The_Fitzgerald_Reader)\r\n - [Three Novels of F. Scott Fitzgerald ](https://openlibrary.org/works/OL468557W)"
    },
    {
      "title": "Jamrach's Menagerie",
      "author": "Carol Birch",
      "openlibrary_key": "OL15414719W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "description": "Jaffy Brown is running through the London backstreets when he comes face to face with the escaped circus animal. His life is transformed by the encounter. Plucked from the jaws of death by Mr Jamrach, the two strike up a friendship. Before he knows it, Jaffy finds himself on board a ship bound for the South Seas."
    },
    {
      "title": "The Sense of an Ending",
      "author": "Julian Barnes",
      "openlibrary_key": "OL15991772W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "By an acclaimed writer at the height of his powers, The Sense of an Ending extends a streak of extraordinary books that began with the best-selling Arthur & George and continued with Nothing to Be Frightened Of and, most recently, Pulse.\r\n \r\nThis intense new novel follows a middle-aged man as he contends with a past he has never much thought about—until his closest childhood friends return with a vengeance, one of them from the grave, another maddeningly present. Tony Webster thought he’d left all this behind as he built a life for himself, and by now his marriage and family and career have fallen into an amicable divorce and retirement. But he is then presented with a mysterious legacy that obliges him to reconsider a variety of things he thought he’d understood all along, and to revise his estimation of his own nature and place in the world. \r\n \r\nA novel so compelling that it begs to be read in a single sitting, with stunning psychological and emotional depth and sophistication, The Sense of an Ending is a brilliant new chapter in Julian Barnes’s oeuvre."
    },
    {
      "title": "The Sisters Brothers",
      "author": "Patrick deWitt",
      "openlibrary_key": "OL16190670W",
      "date_read": "2012-01-03",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Hermann Kermit Warm is going to die. The enigmatic and powerful man known only as the Commodore has ordered it, and his henchmen, Eli and Charlie Sisters, will make sure of it. Though Eli doesn't share his brother's appetite for whiskey and killing, he's never known anything else. But their prey isn't an easy mark, and on the road from Oregon City to Warm's gold-mining claim outside Sacramento, Eli begins to question what he does for a living - and whom he does it for.\r\n\r\nWith The Sisters Brothers, Patrick deWitt pays homage to the classic Western, transforming it into an unforgettable comic tour de force. Filled with a remarkable cast of characters - losers, cheaters, and ne'er-do-wells from all stripes of life - and told by a complex and compelling narrator, it is a violent, lustful odyssey through the underworld of the 1850s frontier that beautifully captures the humor, melancholy, and grit of the Old West, and two brothers bound by blood, violence, and love."
    },
    {
      "title": "Steve Jobs",
      "author": "Walter Isaacson",
      "openlibrary_key": "OL16085155W",
      "date_read": "2011-09-11",
      "favourite": false,
      "genres": [
        "Biography",
        "Business & Management",
        "Non-Fiction"
      ],
      "description": "Based on more than forty interviews with Jobs conducted over two years -- as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues -- Walter Isaacson has written a riveting story of the roller-coaster life and searingly intense personality of a creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing. At a time when America is seeking ways to sustain its innovative edge, and when societies around the world are trying to build digital-age economies, Jobs stands as the ultimate icon of inventiveness and applied imagination. He knew that the best way to create value in the twenty-first century was to connect creativity with technology. He built a company where leaps of the imagination were combined with remarkable feats of engineering. Although Jobs cooperated with this book, he asked for no control over what was written nor even the right to read it before it was published. He put nothing off-limits. He encouraged the people he knew to speak honestly. And Jobs speaks candidly, sometimes brutally so, about the people he worked with and competed against. His friends, foes, and colleagues provide an unvarnished view of the passions, perfectionism, obsessions, artistry, devilry, and compulsion for control that shaped his approach to business and the innovative products that resulted. Driven by demons, Jobs could drive those around him to fury and despair. But his personality and products were interrelated, just as Apple's hardware and software tended to be, as if part of an integrated system. His tale is instructive and cautionary, filled with lessons about innovation, character, leadership, and values. - Publisher."
    },
    {
      "title": "State of Emergency",
      "author": "Dominic Sandbrook",
      "openlibrary_key": "OL28349423W",
      "date_read": "2011-09-11",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "JavaScript: The Definitive Guide",
      "author": "David Flanagan",
      "openlibrary_key": "OL1643770W",
      "date_read": "2011-06-29",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Programming",
        "Reference"
      ],
      "first_publish_date": "1996",
      "description": "JavaScript is a powerful, object-based scripting language; JavaScript programs can be embedded directly into HTML web pages. When combined with the Document Object Model (DOM) defined by a web browser, JavaScript allows you to create Dynamic HTML (DHTML) content and interactive client-side web applications. JavaScript syntax is based on the popular programming languages C, C++, and Java, which makes it familiar and easy to learn for experienced programmers. At the same time, JavaScript is an interpreted scripting language, providing a flexible, forgiving environment in which new programmers can learn.\r\n\r\n*JavaScript: The Definitive Guide* provides a thorough description of the core JavaScript language and both the legacy and standard DOMs implemented in web browsers. The book includes sophisticated examples that show you how to handle common tasks such as validating form data, working with cookies, and creating portable DHTML animations. The book also contains detailed reference sections that cover the core JavaScript API, the legacy client-side API, and the W3C standard DOM API, documenting every JavaScript object, method, property, constructor, constant, function, and event handler in those APIs.\r\n\r\nThis fourth edition of the bestselling JavaScript book has been carefully updated to cover JavaScript 1.5 (ECMAScript Version 3). The book also provides complete coverage of the W3C DOM standard (Level 1 and Level 2), while retaining material on the legacy Level 0 DOM for backward compatibility.\r\n\r\n*JavaScript: The Definitive Guide* is a complete programmer's guide and reference manual for JavaScript. It is particularly useful for developers working with the latest standards-compliant web browsers, such as Internet Explorer 6, Netscape 6, and Mozilla. HTML authors can learn how to use JavaScript to build dynamic web pages. Experienced programmers can quickly find the information they need to start writing sophisticated JavaScript programs. This book is an indispensable reference for all JavaScript programmers, regardless of experience level.\r\n\r\n----------\r\n*Description from the Fourth Edition (2007, O'Reilly Media)*\r\n\r\n<h2>Printing History</h2>\r\n<dl> \r\n<dt>August 1996</dt>\r\n<dd>Beta Edition.</dd>\r\n<dt>January 1997</dt>\r\n<dd>Second Edition.</dd> \r\n<dt>June 1998</dt>\r\n<dd>Third Edition.</dd> \r\n<dt>January 2002</dt>\r\n<dd>Fourth Edition.</dd> \r\n</dl>"
    },
    {
      "title": "The Terrible Privacy Of Maxwell Sim",
      "author": "Jonathan Coe",
      "openlibrary_key": "OL15179403W",
      "date_read": "2011-05-27",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Maxwell Sim seems to have hit rock bottom. Estranged from his father, newly divorced, unable to communicate with his only daughter, he realizes that while he may have seventy-four friends on Facebook, there is nobody in the world with whom he can actually share his problems. Then a business proposition comes his way - a strange exercise in corporate PR that will require him to spend a week driving from London to a remote retail outlet on the Shetland Isles. Setting out with an open mind, good intentions and a friendly voice on his SatNav for company, Maxwell finds that this journey soon takes a more serious turn, and carries him not only to the furthest point of the United Kingdom, but into some of the deepest and darkest corners of his own past. In his sparkling and hugely enjoyable new book Jonathan Coe reinvents the picaresque novel for our time."
    },
    {
      "title": "The New Confessions",
      "author": "William Boyd",
      "openlibrary_key": "OL74630W",
      "date_read": "2011-05-27",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Cosmos",
      "author": "Carl Sagan",
      "openlibrary_key": "OL15829966W",
      "date_read": "2011-05-27",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Science"
      ],
      "first_publish_date": "1980",
      "description": "This book is about science in its broadest human context, how science and civilization grew up together. It is the story of our long journey of discovery and the forces and individuals who helped to shape modern science, including Democritus, Hypatia, Kepler, Newton, Huygens, Champollion, Lowell and Humason. The book also explores spacecraft missions of discovery of the nearby planets, the research in the Library of ancient Alexandria, the human brain, Egyptian hieroglyphics, the origin of life, the death of the Sun, the evolution of galaxies and the origins of matter, suns and worlds. The author retraces the fifteen billion years of cosmic evolution that have transformed matter into life and consciousness, enabling the cosmos to wonder about itself. He considers the latest findings on life elsewhere and how we might communicate with the beings of other worlds. ~ WorldCat.org"
    },
    {
      "title": "Infinite Jest",
      "author": "David Foster Wallace",
      "openlibrary_key": "OL2943602W",
      "date_read": "2011-05-27",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "1996",
      "description": "A gargantuan, mind-altering comedy about the Pursuit of Happiness in America Set in an addicts' halfway house and a tennis academy, and featuring the most endearingly screwed-up family to come along in recent fiction, Infinite Jest explores essential questions about what entertainment is and why it has come to so dominate our lives; about how our desire for entertainment affects our need to connect with other people; and about what the pleasures we choose say about who we are. Equal parts philosophical quest and screwball comedy, Infinite Jest bends every rule of fiction without sacrificing for a moment its own entertainment value. It is an exuberant, uniquely American exploration of the passions that make us human - and one of those rare books that renew the idea of what a novel can do."
    },
    {
      "title": "The Critique of Practical Reason",
      "author": "Immanuel Kant",
      "openlibrary_key": "OL15183751W",
      "date_read": "2010-12-27",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Philosophy"
      ],
      "description": "The Critique of Practical Reason is the second of Kant's three Critiques, following Critique of Pure Reason. In it he distinguishes between actual practical reason and desire-based practical reason, arguing for the first and against the application of the second. He sees practical reason as something to be cultivated and moreover believes Freedom can be proven by it."
    },
    {
      "title": "Learning PHP, MySQL, and JavaScript",
      "author": "Robin Nixon",
      "openlibrary_key": "OL9559525W",
      "date_read": "2010-10-31",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Programming",
        "Reference"
      ],
      "description": "Learning PHP, MySQL & JavaScript will teach you how to create responsive, data-driven websites with the three central technologies of PHP, MySQL and JavaScript - whether or not you know how to program. This simple, streamlined guide explains how the powerful combination of PHP and MySQL provides a painless way to build modern websites with dynamic data and user interaction. You'll also learn how to add JavaScript to create rich Internet websites and applications, and how to use Ajax to handle background communication with a web server. This book explains each technology separately, shows you how to combine them, and introduces valuable concepts in modern web programming, including objects, XHTML, cookies, regular expressions and session management."
    },
    {
      "title": "At Home",
      "author": "Bill Bryson",
      "openlibrary_key": "OL15100470W",
      "date_read": "2010-05-27",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction"
      ],
      "description": "At Home: A Short History of Private Life is a history of domestic life written by Bill Bryson. It was published in May 2010. The book covers topics of the commerce, architecture, technology and geography that have shaped homes into what they are today, told through a series of \"tours\" through Bryson's Norfolk rectory that quickly digress into the history of each particular room."
    },
    {
      "title": "The Dark Stuff",
      "author": "Nick Kent",
      "openlibrary_key": "OL2930841W",
      "date_read": "2010-05-27",
      "favourite": false,
      "genres": [
        "Essays",
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "first_publish_date": "1994",
      "description": "This work by the rock critic Nick Kent, profiles Brian Wilson, Miles Davis, Jerry Lee Lewis, Roy Orbison, Sid Vicious, and Kurt Cobain and more."
    },
    {
      "title": "The Rough Guide to Malaysia, Singapore and Brunei",
      "author": "Charles de Ledesma",
      "openlibrary_key": "OL19460228W",
      "date_read": "2010-04-26",
      "favourite": false,
      "genres": [
        "Travel"
      ],
      "description": ""
    },
    {
      "title": "Strange Days Indeed",
      "author": "Francis Wheen",
      "openlibrary_key": "OL21587010W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction"
      ],
      "description": "\"Strange Days Indeed tells the story of the decade that a young Francis Wheen walked into having pronounced he was dropping out to join the alternative society. Instead of the optimistic dreams of the Sixties he found a world on the verge of a collective nervous breakdown, huddled over candles waiting for the next terrorist bomb, kidnapping or food shortage warning.\" \"Whether it was Nixon's demented behaviour in the White House, Harold Wilson's insistence that 'they' (whoever 'they' were) were out to get him, or the trial of Rupert Bear, it is a story almost too fantastical to be true. With his acute sense of the absurd, Francis Wheen slices through the pungent melange of mistrust and conspiratorial fever to expose the sickly form of a decade in which nations were brought to a sclerotic halt by power cults, military coups, economic anarchy and the arrival of Uri Geller.\"--Jacket."
    },
    {
      "title": "Little Brother",
      "author": "Cory Doctorow",
      "openlibrary_key": "OL5734718W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Seventeen year old Marcus and his friends are in the wrong place at the wrong time during a major terrorist attack on San Francisco. They are held be the Department of Homland Security for days before being release only to discover that their city has turned into surveillance society police state. They decide to resist in the only way they know how by taking on the DHS.\r\n\r\nThis book is distributed freely under a Creative Commons Attribution-Noncommercial-ShareAlike license from the author's website."
    },
    {
      "title": "A Fraction Of The Whole",
      "author": "Steve Toltz",
      "openlibrary_key": "OL12439089W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "2008",
      "description": "\"The fact is, the whole of Australia despises my father more than any other man, just as they adore my uncle more than any other man. I might as well set the story straight about both of them... Heroes or Criminals? Crackpots or Visionaries? Families or Enemies?\" Anyway, you know how it is. Every family has a story like this one.\r\n\r\nMost of his life, Jasper Dean couldn't decide whether to pity, hate, love, or murder his certifiably paranoid father, Martin, a man who overanalyzed anything and everything and imparted his self-garnered wisdom to his only son. But now that Martin is dead, Jasper can fully reflect on the crackpot who raised him in intellectual captivity, and what he realizes is that, for all its lunacy, theirs was a grand adventure.\r\n\r\nAs he recollects the events that led to his father's demise, Jasper recounts a boyhood of outrageous schemes and shocking discoveries--about his infamous outlaw uncle Terry, his mysteriously absent European mother, and Martin's constant losing battle to make a lasting mark on the world he so disdains. It's a story that takes them from the Australian bush to the cafes of bohemian Paris, from the Thai jungle to strip clubs, asylums, labyrinths, and criminal lairs, and from the highs of first love to the lows of failed ambition. The result is a rollicking roller-coaster ride from obscurity to infamy, and the moving, memorable story of a father and son whose spiritual symmetry transcends all their many shortcomings. *A Fraction of the Whole* is an uproarious indictment of the modern world and its mores and the epic debut of the blisteringly funny and talented Steve Toltz."
    },
    {
      "title": "The Road",
      "author": "Cormac McCarthy",
      "openlibrary_key": "OL40873W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "Cormac McCarthy's tenth novel, The Road, is his most harrowing yet deeply personal work. Some unnamed catastrophe has scourged the world to a burnt-out cinder, inhabited by the last remnants of mankind and a very few surviving dogs and fungi. The sky is perpetually shrouded by dust and toxic particulates; the seasons are merely varied intensities of cold and dampness. Bands of cannibals roam the roads and inhabit what few dwellings remain intact in the woods.\r\n\r\nThrough this nightmarish residue of America a haggard father and his young son attempt to flee the oncoming Appalachian winter and head towards the southern coast along carefully chosen back roads. Mummified corpses are their only benign companions, sitting in doorways and automobiles, variously impaled or displayed on pikes and tables and in cake bells, or they rise in frozen poses of horror and agony out of congealed asphalt. The boy and his father hope to avoid the marauders, reach a milder climate, and perhaps locate some remnants of civilization still worthy of that name. They possess only what they can scavenge to eat, and the rags they wear and the heat of their own bodies are all the shelter they have. A pistol with only a few bullets is their only defense besides flight. Before them the father pushes a shopping cart filled with blankets, cans of food and a few other assets, like jars of lamp oil or gasoline siphoned from the tanks of abandoned vehicles—the cart is equipped with a bicycle mirror so that they will not be surprised from behind.\r\n\r\nThrough encounters with other survivors brutal, desperate or pathetic, the father and son are both hardened and sustained by their will, their hard-won survivalist savvy, and most of all by their love for each other. They struggle over mountains, navigate perilous roads and forests reduced to ash and cinders, endure killing cold and freezing rainfall. Passing through charred ghost towns and ransacking abandoned markets for meager provisions, the pair battle to remain hopeful. They seek the most rudimentary sort of salvation. However, in The Road, such redemption as might be permitted by their circumstances depends on the boy’s ability to sustain his own instincts for compassion and empathy in opposition to his father’s insistence upon their mutual self-interest and survival at all physical and moral costs.\r\n\r\nThe Road was the winner of the 2006 Pulitzer Prize for Literature.\r\n([source][1])\r\n\r\n\r\n  [1]: https://www.cormacmccarthy.com/works/the-road/"
    },
    {
      "title": "Motherless Brooklyn",
      "author": "Jonathan Lethem",
      "openlibrary_key": "OL74409W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "description": "From Amazon: Brooklyn's very own self-appointed Human Freakshow, Lionel Essrog is an orphan whose Tourettic impulses drive him to bark, count, and rip apart our language in startling and original ways. Together with three veterans of the St. Vincent's Home for Boys, he works for small-time mobster Frank Minna's limo service cum detective agency. Life without Frank Minna, the charismatic King of Brooklyn, would be unimaginable, so who cares if the tasks he sets them are, well, not exactly legal. But when Frank is fatally stabbed, one of Lionel's colleagues lands in jail, the other two vie for his position, and the victim's widow skips town. Lionel's world is suddenly topsy-turvy, and this outcast who has trouble even conversing attempts to untangle the threads of the case while trying to keep the words straight in his head."
    },
    {
      "title": "Apathy for the Devil",
      "author": "Nick Kent",
      "openlibrary_key": "OL15891106W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Memoir",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Clockers",
      "author": "Richard Price",
      "openlibrary_key": "OL7969104W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "CSS Mastery",
      "author": "Andy Budd",
      "openlibrary_key": "OL16920927W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Programming"
      ],
      "description": ""
    },
    {
      "title": "Psychotic Reactions and Carburetor Dung",
      "author": "Lester Bangs",
      "openlibrary_key": "OL4650344W",
      "date_read": "2010-04-13",
      "favourite": false,
      "genres": [
        "Essays",
        "Music",
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "Processing",
      "author": "Casey Reas",
      "openlibrary_key": "OL15120450W",
      "date_read": "2010-02-18",
      "favourite": false,
      "genres": [
        "Programming",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Designing for Interaction",
      "author": "Dan Saffer",
      "openlibrary_key": "OL9221137W",
      "date_read": "2009-10-14",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Reference"
      ],
      "description": "This is the eBook version of the printed book.Explore the new design discipline that is behind such products as the iPod and innovative Web sites like Flicer. While other books on this subject are either aimed at more seasoned practitioners or else are too focused on a particular medium like software, this guide will take a more holistic approach to the discipline, looking at interaction design for the Web, software, and devices. It is the only interaction design book that is coming from a designers point of view rather than that of an engineer.  This much-needed guide is more than just a how-to manual. It covers interaction design fundamentals, approaches to designing, design research, and more, and spans all mediums—Internet, software, and devices. Even robots! Filled with tips, real-world projects, and interviews, you'll get a solid grounding in everything you need to successfully tackle interaction design."
    },
    {
      "title": "Ching’s Chinese Food in Minutes",
      "author": "Ching-He Huang",
      "openlibrary_key": "OL15187590W",
      "date_read": "2009-09-27",
      "favourite": false,
      "genres": [
        "Food Writing"
      ],
      "description": "If you're hungry for good food but short on time you'll love Ching's quick and easy Chinese recipes. The bestselling author is the master of fresh flavours and simple ingredients and her collection of all-time favourites and exciting new dishes are a delight to cook and share. Why order a take-away when you can deliver your own in minutes?With her bestselling cookbook, Chinese Food Made Easy, Ching quickly established herself as the new voice of Chinese cooking with her simple and delicious recipes. Ching's brand new cookbook is packed with quick and easy recipes that you can make in 30 minutes or less. Bursting with flavour, deliciously healthy and nearly always made with everyday supermarket ingredients, her new collection of authentic Chinese recipes is destined to become another kitchen classic.Ching's recipes are as varied as they are exciting and are a wonderful balance of all-time favourites, such as Sweet and Sour Pork, Chicken and Cashew Nut Stir-fry and Hot and Sour Soup, and exciting new authentic dishes such as Exploding River Prawns, Hunan-style Hot Pink Pepper Chicken and Chongqing Beef. For more special days when you have a little more time on your hands there is an Easy Entertaining section complete with menu suggestions and time-saving tips."
    },
    {
      "title": "Design as Art",
      "author": "Bruno Munari",
      "openlibrary_key": "OL1415473W",
      "date_read": "2009-07-24",
      "favourite": false,
      "genres": [
        "Art & Design"
      ],
      "first_publish_date": "1971",
      "description": "How do we see the world around us? The Penguin on Design series includes the works of creative thinkers whose writings on art, design and the media have changed our vision forever. Bruno Munari was among the most inspirational designers of all time, described by Picasso as 'the new Leonardo'. Munari insisted that design be beautiful, functional and accessible, and this enlightening and highly entertaining book sets out his ideas about visual, graphic and industrial design and the role it plays in the objects we use everyday. Lamps, road signs, typography, posters, children's books, advertising, cars and chairs - these are just some of the subjects to which he turns his illuminating gaze."
    },
    {
      "title": "Good Beer Guide 2009",
      "author": "Roger Protz",
      "openlibrary_key": "OL24267568W",
      "date_read": "2009-06-14",
      "favourite": false,
      "genres": [
        "Non-Fiction"
      ],
      "description": ""
    },
    {
      "title": "The Talented Mr. Ripley",
      "author": "Patricia Highsmith",
      "openlibrary_key": "OL59434W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "1973",
      "description": "The first of the acclaimed Ripley novels, this clever psychological thriller introduces the reader to Tom Ripley and his extraordinary modus operandi. Accepting a commission from a wealthy businessman to travel to Italy in an attempt to convince his wayward son to return to the United States, Ripley gradually develops a plan to assume the young man’s identity along with his bank account."
    },
    {
      "title": "The Prisoner of Zenda",
      "author": "Anthony Hope",
      "openlibrary_key": "OL245401W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1894",
      "description": "An adventure novel, originally published in 1894, set in the fictitious European Kingdom of Ruritania. An English tourist is persuaded to impersonate the new king after he is abducted before he can be crowned. This act draws upon him the wrath of the Prince who has had the king abducted and his partner in crime the villainous Rupert of Hentzau."
    },
    {
      "title": "On the Road",
      "author": "Jack Kerouac",
      "openlibrary_key": "OL65906W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "1996",
      "description": "Described as everything from a \"last gasp\" of romantic fiction to a founding text of the Beat Generation movement, this story amounts to a nonfiction novel (as critics were later to describe some works).  Unpublished writer buddies wander from coast to coast in search of whatever they find, eager for experience.  Kerouac's spokesman is Sal Paradise (himself) and real-life friend Neal Casady appears as Dean Moriarty."
    },
    {
      "title": "The Unbearable Lightness of Being",
      "author": "Milan Kundera",
      "openlibrary_key": "OL8972751W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "October 1997",
      "description": "Interweaves story and dream, past and present, and philosophy and poetry in a sardonic and erotic tale of two couples--Tomas and Teresa, and Sabina and her Swiss lover, Gerhart."
    },
    {
      "title": "The New York Trilogy",
      "author": "Paul Auster",
      "openlibrary_key": "OL1682241W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Fiction"
      ],
      "first_publish_date": "1987",
      "description": "The New York Trilogy is an astonishing and original book: three cleverly interconnected novels that exploit the elements of standard detective fiction and achieve a new genre that is all the more gripping for its starkness. In each story the search for clues leads to remarkable coincidences in the universe as the simple act of trailing a man ultimately becomes a startling investigation of what it means to be human. Auster's book is modern fiction at its finest: bold, arresting and unputdownable."
    },
    {
      "title": "Nineteen Seventy Four",
      "author": "David Peace",
      "openlibrary_key": "OL22140556W",
      "date_read": "2009-03-19",
      "favourite": false,
      "genres": [
        "Crime",
        "Fiction"
      ],
      "description": ""
    },
    {
      "title": "Sketching User Experiences",
      "author": "Bill Buxton",
      "openlibrary_key": "OL7940434W",
      "date_read": "2009-01-16",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": "Sketching User Experiences approaches design and design thinking as something distinct that needs to be better understood-by both designers and the people with whom they need to work- in order to achieve success with new products and systems. So while the focus is on design, the approach is holistic. Hence, the book speaks to designers, usability specialists, the HCI community, product managers, and business executives. There is an emphasis on balancing the back-end concern with usability and engineering excellence (getting the design right) with an up-front investment in sketching and ideation (getting the right design). Overall, the objective is to build the notion of informed design: molding emerging technology into a form that serves our society and reflects its values.\r\n\r\nGrounded in both practice and scientific research, Bill Buxton's engaging work aims to spark the imagination while encouraging the use of new techniques, breathing new life into user experience design.\r\n\r\n - Covers sketching and early prototyping design methods suitable for dynamic product capabilities: cell phones that communicate with each other and other embedded systems, \"smart\" appliances, and things you only imagine in your dreams\r\n - Thorough coverage of the design sketching method which helps easily build experience prototypes-without the effort of engineering prototypes which are difficult to abandon\r\n - Reaches out to a range of designers, including user interface designers, industrial designers, software engineers, usability engineers, product managers, and others\r\n - Full of case studies, examples, exercises, and projects, and access to video clips that demonstrate the principles and methods"
    },
    {
      "title": "Designing Interfaces",
      "author": "Jennifer Tidwell",
      "openlibrary_key": "OL8167456W",
      "date_read": "2007-09-28",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Essential Actionscript 3.0",
      "author": "Colin Moock",
      "openlibrary_key": "OL5759278W",
      "date_read": "2007-09-28",
      "favourite": false,
      "genres": [
        "Programming",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "ActionScript 3.0 Cookbook",
      "author": "Joey Lott",
      "openlibrary_key": "OL16924196W",
      "date_read": "2007-09-28",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Programming",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Complete Best Man",
      "author": "John Bowden",
      "openlibrary_key": "OL3143393W",
      "date_read": "2007-07-28",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Reference"
      ],
      "first_publish_date": "August 15, 2006",
      "description": ""
    },
    {
      "title": "The Digital Photography Book",
      "author": "Scott Kelby",
      "openlibrary_key": "OL20019680W",
      "date_read": "2007-01-05",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Photography",
        "Reference"
      ],
      "description": "In parts 1 through 4 of this series, the most popular chapter in the book has always been the last chapter: \"Photo Recipes to Help You Get 'The Shot'.\" In each of those chapters, Scott shows a final image and then describes how to get that type of shot. Here, in part 5, he gives you what you've been waiting for: an entire book of nothing but those amazing photo recipes. But, he took it up a big notch by adding a behind-the-scenes photo for every single recipe. Now you can see exactly how it was done, so you can get that exact same look every time. In these extra pages, each spread allows you to dig in a little deeper and really unlock the power of these recipes. Scott breaks each spread into four segments: (1) he explains exactly what you're seeing behind the scenes, (2) he lists all of his camera settings, and lens and lighting info--it's all there, (3) he gives you his thought process, so you learn exactly why he does it this way, and (4) he shares all the post-processing in Lightroom or Photoshop that goes on after the shoot."
    },
    {
      "title": "Wall and Piece",
      "author": "Banksy",
      "openlibrary_key": "OL8774127W",
      "date_read": "2007-01-05",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Non-Fiction",
        "Photography"
      ],
      "description": ""
    },
    {
      "title": "Understanding Exposure",
      "author": "Bryan Peterson",
      "openlibrary_key": "OL3901933W",
      "date_read": "2006-07-04",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Photography",
        "Reference"
      ],
      "description": "Veteran photographer Bryan Peterson demystifies complex concepts of exposure in photography by explaining the fundamentals of light, aperture, shutter speed, and how they interact with and influence one another. This book explains how to get or lose sharpness and contrast in images, freeze in action, and take the best meter readings while also exploring filters, flash, and light. This forth edition includes all new images as well as an expanded section on flash, tips for using colored gels, and advice on shooting star trails."
    },
    {
      "title": "The Digital SLR Handbook",
      "author": "Michael Freeman",
      "openlibrary_key": "OL21585017W",
      "date_read": "2006-07-04",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Photography",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Right Stuff",
      "author": "Tom Wolfe",
      "openlibrary_key": "OL1925474W",
      "date_read": "2006-07-04",
      "favourite": false,
      "genres": [
        "History",
        "Non-Fiction",
        "Science"
      ],
      "first_publish_date": "1979",
      "description": ""
    },
    {
      "title": "The Encyclopedia of Watercolour Techniques",
      "author": "Hazel Harrison",
      "openlibrary_key": "OL1986909W",
      "date_read": "2006-06-05",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Reference"
      ],
      "first_publish_date": "1987",
      "description": ""
    },
    {
      "title": "The Elements of Style",
      "author": "William Strunk",
      "openlibrary_key": "OL38285W",
      "date_read": "2006-05-09",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Reference"
      ],
      "first_publish_date": "1959",
      "description": "You know the authors' names. You recognize the title. You've probably used this book yourself. And now The Elements of Style-the most widely read and employed English style manual-is available in a specially bound 50th Anniversary Edition that offers the title's vast audience an opportunity to own a more durable and elegantly bound edition of this time-tested classic.\r\n\r\nOffering the same content as the Fourth Edition, revised in 1999, the new casebound 50th Anniversary Edition includes a brief overview of the book's illustrious history. Used extensively by individual writers as well as high school and college students of writing, it has conveyed the principles of English style to millions of readers. This new deluxe edition makes the perfect gift for writers of any age and ability level."
    },
    {
      "title": "The \"Richard and Judy\" Wine Guide",
      "author": "Susy Atkins",
      "openlibrary_key": "OL21713618W",
      "date_read": "2006-04-22",
      "favourite": false,
      "genres": [
        "Non-Fiction"
      ],
      "description": "'The Richard & Judy Wine Guide' takes you on a fun and fact-filled journey through the world of wine from the vine to the bottle, with tasting tips that will transform your drinking experience and impress your friends and family."
    },
    {
      "title": "Crucial Confrontations",
      "author": "Kerry Patterson",
      "openlibrary_key": "OL15172340W",
      "date_read": "2006-04-18",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Psychology",
        "Self-Help"
      ],
      "description": "The authors of the New York Times bestseller Crucial Conversations show you how to achieve personal, team, and organizational success by healing broken promises, resolving violated expectations, and influencing good behaviorDiscover skills to resolve touchy, controversial, and complex issues at work and at home--now available in this follow-up to the internationally popular Crucial Conversations.Behind the problems that routinely plague organizations and families, you'll find individuals who are either unwilling or unable to deal with failed promises. Others have broken rules, missed deadlines, failed to live up to commitments, or just plain behaved badly--and nobody steps up to the issue. Or they do, but do a lousy job and create a whole new set of problems. Accountability suffers and new problems spring up. New research demonstrates that these disappointments aren't just irritating, they're costly--sapping organizational performance by twenty to fifty percent and accounting for up to ninety percent of divorces.Crucial Confrontations teaches skills drawn from 10,000 hours of real-life observations to increase confidence in facing issues like:An employee speaks to you in an insulting tone that crosses the line between sarcasm and insubordination. Now what?Your boss just committed you to a deadline you know you can't meet--and not-so-subtly hinted he doesn't want to hear complaints about it.Your son walks through the door sporting colorful new body art that raises your blood pressure by forty points. Speak now, pay later.An accountant wonders how to step up to a client who is violating the law. Can you spell unemployment?Family members fret over how to tell granddad that he should no longer drive his car. This is going to get ugly.A nurse worries about what to say to an abusive physician. She quickly remembers \"how things work around here\" and decides not to say anything.Everyone knows how to run for cover, or if adequately provoked, step up to these confrontations in a way that causes a real ruckus. That we have down pat. Crucial Confrontations teaches you how to deal with violated expectations in a way that solves the problem at hand, and doesn't harm the relationship--and in fact, even strengthens it.Crucial Confrontations borrows from twenty years of research involving two groups. More than 25,000 people helped the authors identify those who were most influential during crucial confrontations. They spent 10,000 hours watching these people, documented what they saw, and then trained and tested with more than 300,000 people. Second, they measured the impact of crucial confrontations improvements on organizational and team performance--the results were immediate and sustainable: twenty to fifty percent improvements in measurable performance."
    },
    {
      "title": "Getting to Yes",
      "author": "Roger Fisher",
      "openlibrary_key": "OL1837566W",
      "date_read": "2006-04-18",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Psychology"
      ],
      "first_publish_date": "1981",
      "description": "Getting to Yes offers a concise, step-by-step, proven strategy for coming to mutually acceptable agreements in every sort of conflict—whether it involves parents and children, neighbors, bosses and employees, customers or corporations, tenants or diplomats. Based on the work of the Harvard Negotiation Project, a group that deals continually with all levels of negotiation and conflict resolution from domestic to business to international, Getting to Yes tells you how to:Separate the people from the problem;Focus on interests, not positions;Work together to create options that will satisfy both parties; andNegotiate successfully with people who are more powerful, refuse to play by the rules, or resort to \"dirty tricks.\"Since its original publication in 1981, Getting to Yes has been translated into 18 languages and has sold over 1 million copies in its various editions. This completely revised edition is a universal guide to the art of negotiating personal and professional disputes. It offers a concise strategy for coming to mutually acceptable agreements in every sort of conflict."
    },
    {
      "title": "Kick in the Seat of the Pants",
      "author": "Roger Von Oech",
      "openlibrary_key": "OL1870403W",
      "date_read": "2006-04-18",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction"
      ],
      "first_publish_date": "1986",
      "description": ""
    },
    {
      "title": "The Rough Guide to Sardinia",
      "author": "Robert Andrews",
      "openlibrary_key": "OL5950463W",
      "date_read": "2006-04-07",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Travel"
      ],
      "description": ""
    },
    {
      "title": "American Splendor: The Life and Times of Harvey Pekar",
      "author": "Harvey Pekar",
      "openlibrary_key": "OL3280251W",
      "date_read": "2006-03-14",
      "favourite": false,
      "genres": [
        "Graphic Novel",
        "Memoir",
        "Non-Fiction"
      ],
      "first_publish_date": "2003",
      "description": ""
    },
    {
      "title": "American Splendor: Our Movie Year",
      "author": "Harvey Pekar",
      "openlibrary_key": "OL3280249W",
      "date_read": "2006-03-14",
      "favourite": false,
      "genres": [
        "Graphic Novel",
        "Memoir",
        "Non-Fiction"
      ],
      "first_publish_date": "December 2004",
      "description": ""
    },
    {
      "title": "Best of American Splendor",
      "author": "Harvey Pekar",
      "openlibrary_key": "OL3280253W",
      "date_read": "2006-03-14",
      "favourite": false,
      "genres": [
        "Graphic Novel",
        "Memoir",
        "Non-Fiction"
      ],
      "first_publish_date": "2005",
      "description": "A collection of American Splendor comics, featuring autobiographical strips about the author's life and work."
    },
    {
      "title": "American Splendor Presents: Bob and Harv's Comics",
      "author": "Harvey Pekar",
      "openlibrary_key": "OL3280250W",
      "date_read": "2006-03-14",
      "favourite": false,
      "genres": [
        "Graphic Novel",
        "Memoir",
        "Non-Fiction"
      ],
      "first_publish_date": "1996",
      "description": ""
    },
    {
      "title": "Designing Brand Identity",
      "author": "Alina Wheeler",
      "openlibrary_key": "OL5853008W",
      "date_read": "2005-10-20",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": "\"Designing Brand Identity is an essential toolkit for branding and design firms, marketing and design students, and clients. This comprehensive and accessible resource meticulously maps out the process, provides the fundamentals, and never loses sight of the big picture. From translating the vision of a CEO and conducting research, through designing a sustainable identity program and building online branding tools, this book helps companies create stronger brands.\"--BOOK JACKET."
    },
    {
      "title": "Wally Olins. On B®and",
      "author": "Wally Olins",
      "openlibrary_key": "OL4442925W",
      "date_read": "2005-10-20",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Kotler on Marketing",
      "author": "Philip Kotler",
      "openlibrary_key": "OL1807508W",
      "date_read": "2005-06-30",
      "favourite": false,
      "genres": [
        "Business & Management",
        "Non-Fiction",
        "Reference"
      ],
      "first_publish_date": "1999",
      "description": ""
    },
    {
      "title": "A Walk in the Woods",
      "author": "Bill Bryson",
      "openlibrary_key": "OL74123W",
      "date_read": "2005-04-18",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction",
        "Travel"
      ],
      "description": "Bill Bryson describes his attempt to walk the Appalachian Trail with his friend \"Stephen Katz\". The book is written in a humorous style, interspersed with more serious discussions of matters relating to the trail's history, and the surrounding sociology, ecology, trees, plants, animals and people."
    },
    {
      "title": "Down Under",
      "author": "Bill Bryson",
      "openlibrary_key": "OL74115W",
      "date_read": "2005-04-18",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction",
        "Travel"
      ],
      "description": "*In a Sunburned Country* is the 2000 travelogue book about Australia written by best-selling travel writer Bill Bryson. The title is taken from the famous Australian poem, \"My Country\".  In other countries, including Britain, the book was titled *Down Under*.\r\n\r\nIn this book, Bill Bryson describes his travels by railway and car throughout Australia, his conversations with people in all walks of life about the history, geography, unusual plants and animals of the country, and his wry impressions of the life, culture and amenities (or lack thereof) in each locality.  \r\n\r\nIn a style similar to his book *A Walk in the Woods*, Bryson's research enabled him to include many stories about Australia's 19th-century explorers and settlers who suffered extreme deprivations, as well as details about its natural resources, culture, and economy. His writings are intertwined with recurring humorous themes, notably, in the chapter Crossing Australia he makes constant reference to drinking of urine to survive, as was done by many 19th century explorers."
    },
    {
      "title": "Neither Here Nor There",
      "author": "Bill Bryson",
      "openlibrary_key": "OL74125W",
      "date_read": "2005-04-18",
      "favourite": false,
      "genres": [
        "Memoir",
        "Non-Fiction",
        "Travel"
      ],
      "description": "Bill Bryson's second, achingly funny book, retracing his own steps as a student backpacking through Europe, twenty years later.Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither here Nor there he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hamemrfest, the northernmost town on the continent, to istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before.Whether braving the homicidal motorists of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein."
    },
    {
      "title": "Apple Pro Training Series: Motion",
      "author": "Damian Allen",
      "openlibrary_key": "OL5855763W",
      "date_read": "2005-02-16",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Flashman",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823721W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "November 1992",
      "description": "Fraser’s comic novel, written as an autobiographical account, tells the story of Harry Flashman, the bully from Tom Brown’s Schooldays, in his own words. Beginning with his expulsion from Rugby School Flashman goes on to join Lord Cardigan’s Light Dragoons and despite his best efforts to avoid any fighting inadvertently becomes a national hero due to some unlikely exploits in the Anglo-Afghan War."
    },
    {
      "title": "Royal Flash",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823731W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1970",
      "description": ""
    },
    {
      "title": "Flash for Freedom!",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823719W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1971",
      "description": "A game of cards leads Flashman from the jungle death-house of Dahomey to the slave state of Mississippi as he dabbles in the slave trade in Volume II of the Flashman PapersWhen Flashman was inveigled into a game of pontoon with Disraeli and Lord George Bentinck, he was making an unconscious choice about his own future – would it lie in the House of Commons or the West African slave trade? Was there, for that matter, very much difference?Once again Flashman's charm, cowardice, treachery, lechery and fleetness of foot see the lovable rogue triumph by the skin of his chattering teeth."
    },
    {
      "title": "Flashman at the Charge",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823720W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1973",
      "description": "Celebrated Victorian bounder, cad, and lecher, Sir Harry Flashman, V. C. , returns to play his (reluctant) part in the charge of the Light Brigade in the fourth volume of the critically acclaimed Flashman Papers. As the British cavalry prepared to launch themselves against the Russian guns at Balaclava, Harry Flashman was petrified. But the Crimea was only the beginning: beyond lay the snowbound wastes of the great Russian slave empire, torture and death, headlong escapes from relentless enemies, savage tribal hordes to the right of him, passionate females to the left of him... And finally that unknown but desperate war on the roof of the world, when India was the prize, and there was nothing to stop the armed might of Imperial Russia but the wavering sabre and terrified ingenuity of old Flashy himself."
    },
    {
      "title": "Flashman in the Great Game",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823777W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1975",
      "description": ""
    },
    {
      "title": "Flashman and the Redskins",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823774W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1982",
      "description": "Flashman is in America fleeing a murder charge, traveling with a brothel on wheels toward California, tricking the noble redman while seducing their women, and reaching his moment of supreme ingloriousness and fear--under fire at the Battle of Little Big Horn."
    },
    {
      "title": "Flashman's Lady",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823752W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "February 1, 1979",
      "description": ""
    },
    {
      "title": "Flashman and the Angel of the Lord",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823770W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1994",
      "description": ""
    },
    {
      "title": "Flashman and the Dragon",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823724W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "July 1, 1987",
      "description": ""
    },
    {
      "title": "Flashman and the Mountain of Light",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823765W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1990",
      "description": "Shirking the defence of the Indian frontier in the First Sikh War, Flashman opts for secret service in the court of a nymphomaniac Maharani who wears the legendary Koh-i-Noor diamond in her navel. Volume IX of the Flashman Papers. With the mighty Sikh army poised to invade India, every able-bodied man was needed to defend Britannia's frontier. When the Call of Duty came, Flashman had his answer ready: 'I'll drown in blood first!'Alas for poor Flashy there was no avoiding the terrors of secret service in the debauched and intrigue-ridden court of the Punjab, the attentions of its beautiful nymphomaniac Maharani, the horrors of its torture chambers, or the dread influence of the Mountain of Light."
    },
    {
      "title": "Flashman and the Tiger",
      "author": "George MacDonald Fraser",
      "openlibrary_key": "OL1823742W",
      "date_read": "2005-01-02",
      "favourite": false,
      "genres": [
        "Historical Fiction"
      ],
      "first_publish_date": "1999",
      "description": "Celebrated Victorian bounder, cad, and lecher, Sir Harry Flashman, V. C. , returns in three new episodes, pitted against some of the greatest villains of the day, and observing two of Britain's most famous heroes. Eleventh volume of the critically acclaimed Flashman Papers. When Sir Harry Flashman, V. C. , the celebrated Victorian soldier, scoundrel, amorist and self-confessed poltroon's memoirs first came to light thirty years ago, the world was finally illuminated about what became of the celebrated cowardly bully from Tom Brown's Schooldays. Now, in addition to the other famous adventures of Flash Harry contained in the Flashman Papers, come three new episodes in the career of this eminent if disreputable adventurer. The title piece touches on two of the most spectacular military actions of the century and sees Flashman pitted against one of the greatest villains of the day, and observing, with his usual jaundiced eye, two of its most famous heroes."
    },
    {
      "title": "Designing Web Usability",
      "author": "Jakob Nielsen",
      "openlibrary_key": "OL7941014W",
      "date_read": "2004-11-18",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Business & Management",
        "Programming",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Flash MX Most Wanted",
      "author": "David Doull",
      "openlibrary_key": "OL24432190W",
      "date_read": "2004-11-18",
      "favourite": false,
      "genres": [
        "Non-Fiction",
        "Programming",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "Modern Toss",
      "author": "Jon Link",
      "openlibrary_key": "OL18685754W",
      "date_read": "2004-11-04",
      "favourite": false,
      "genres": [
        "Comics"
      ],
      "description": ""
    },
    {
      "title": "Japanese Graphics Now",
      "author": "Julius Wiedermann",
      "openlibrary_key": "OL9024582W",
      "date_read": "2004-09-06",
      "favourite": false,
      "genres": [
        "Art & Design",
        "Japan",
        "Non-Fiction",
        "Reference"
      ],
      "description": ""
    },
    {
      "title": "The Complete Works (The Oxford Shakespeare)",
      "author": "William Shakespeare",
      "openlibrary_key": "OL259028W",
      "date_read": "2004-08-16",
      "favourite": false,
      "genres": [
        "Fiction",
        "Poetry"
      ],
      "first_publish_date": "September 1975",
      "description": "Contains 44 works:\r\n\r\nPLAYS (37)\r\nAll's well that ends well\r\nAntony and Cleopatra\r\nAs you like it\r\nComedy of errors\r\nCoriolanus\r\nCymbeline\r\n[Hamlet](https://openlibrary.org/works/OL15203981W/Hamlet)\r\nJulius Caesar\r\nKing Henry IV. Part 1\r\nKing Henry IV. Part 2\r\nKing Henry V\r\nKing Henry VI. Part 1\r\nKing Henry VI. Part 2\r\nKing Henry VI. Part 3\r\nKing Henry VIII\r\nKing John\r\nKing Lear\r\nKing Richard II\r\nKing Richard III\r\nLove's labour's lost\r\nMacbeth\r\nMeasure for measure\r\nMerchant of Venice\r\nMerry wives of Windsor\r\nMidsummer night's dream\r\n[Much Ado About Nothing](https://openlibrary.org/works/OL362691W)\r\nOthello, the Moor of Venice\r\nPericles, prince of Tyre\r\n[Romeo and Juliet](https://openlibrary.org/works/OL258796W/Romeo_and_Juliet)\r\nTaming of the shrew\r\n[Tempest](https://openlibrary.org/works/OL362699W)\r\nTimon of Athens\r\nTitus Andronicus\r\nTroilus and Cressida\r\nTwelfth night; or what you will\r\nTwo gentlemen of Verona\r\nWinter's tale\r\n\r\nPOEMS (7)\r\nLover's Complaint\r\nPassionate Pilgrim\r\nPhoenix and the Turtle\r\nRape of Lucrece\r\nSonnets\r\n**Sonnets to Sundry Notes of Music**\r\nVenus and Adonis"
    }
  ]
}